RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
/**
 *******************************************************************************
 * @file  hc32f4a0_interrupts.c
 * @brief This file provides firmware functions to manage the Interrupt Controller
 *        (INTC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Zhangxl         First version
   2020-08-25       Zhangxl         Modify for MISRAC2012-8.4, 8.6, 10.1
   2020-09-09       Zhangxl         Merge EFM0/1 share IRQ handler
   2020-10-30       Zhangxl         Revise I2C TxEmpty & Complete share IRQ handler entry
   2020-11-15       Zhangxl         SPII flag judgment for share IRQ.
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_interrupts.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_INTERRUPTS INTERRUPTS
 * @brief INTC Driver Library
 * @{
 */

#if (DDL_INTERRUPTS_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup INTC_Local_Macros INTC Local Macros
 * @{
 */
/**
 * @brief   Maximum IRQ handler number
 */
#define IRQ_NUM_MAX         (128U)

/**
 * @brief   Wakeup event enable mask
 */
#define INTC_WUPEN_MASK                                                         \
            (INTC_WUPEN_EIRQWUEN    | INTC_WUPEN_SWDTWUEN           |           \
             INTC_WUPEN_PVD1WUEN    | INTC_WUPEN_PVD2WUEN           |           \
             INTC_WUPEN_CMPWUEN     | INTC_WUPEN_WKTMWUEN           |           \
             INTC_WUPEN_RTCALMWUEN  | INTC_WUPEN_RTCPRDWUEN         |           \
             INTC_WUPEN_TMR0GCMWUEN | INTC_WUPEN_TMR2GCMWUEN        |           \
             INTC_WUPEN_TMR2OVFWUEN | INTC_WUPEN_RXWUEN             |           \
             INTC_WUPEN_USHWUEN     | INTC_WUPEN_USFWUEN            |           \
             INTC_WUPEN_ETHWUEN)

/**
 * @}
 */

/**
 * @defgroup INTC_Check_Parameters_Validity INTC Check Parameters Validity
 * @{
 */
/*! Parameter validity check for wakeup source from stop mode. */
#define IS_INTC_WKUP_SRC(src)                                                   \
(   ((src) != 0x00UL)                           &&                              \
    (((src) | INTC_WUPEN_MASK) == INTC_WUPEN_MASK))

/*! Parameter validity check for event index. */
#define IS_INTC_EVENT(event)        ((event) != 0x00UL)

/*! Parameter validity check for interrupt index. */
#define IS_INTC_INT(it)             ((it) != 0x00UL)

/*! Parameter validity check for software interrupt index. */
#define IS_INTC_SWI(swi)            ((swi) != 0x00UL)

/*! Parameter validity check for NMI trigger source. */
#define IS_NMI_SRC(src)                                                         \
(   ((src) != 0x00UL)                           &&                              \
    (((src) | NMI_SRC_MASK) == NMI_SRC_MASK))

/*! Parameter validity check for EXINT filter A function. */
#define IS_EXINT_FAE(fae)                                                       \
(   ((fae) == EXINT_FILTER_A_OFF)               ||                              \
    ((fae) == EXINT_FILTER_A_ON))

/*! Parameter validity check for EXINT filter A clock division. */
#define IS_EXINT_FACLK(faclk)                                                    \
(   ((faclk) == EXINT_FACLK_HCLK_DIV1)          ||                              \
    ((faclk) == EXINT_FACLK_HCLK_DIV8)          ||                              \
    ((faclk) == EXINT_FACLK_HCLK_DIV32)         ||                              \
    ((faclk) == EXINT_FACLK_HCLK_DIV64))

/*! Parameter validity check for EXINT filter B function. */
#define IS_EXINT_FBE(fbe)                                                       \
(   ((fbe) == EXINT_FILTER_B_OFF)               ||                              \
    ((fbe) == EXINT_FILTER_B_ON))

/*! Parameter validity check for EXINT filter B time. */
#define IS_EXINT_FBTIME(fbtime)                                                  \
(   ((fbtime) == EXINT_FBTIM_500NS)             ||                              \
    ((fbtime) == EXINT_FBTIM_1US)               ||                              \
    ((fbtime) == EXINT_FBTIM_2US)               ||                              \
    ((fbtime) == EXINT_FBTIM_4US))


/*! Parameter validity check for EXINT trigger edge. */
#define IS_EXINT_TRIGGER(trigger)                                               \
(   ((trigger) == EXINT_TRIGGER_LOW)            ||                              \
    ((trigger) == EXINT_TRIGGER_RISING)         ||                              \
    ((trigger) == EXINT_TRIGGER_FALLING)        ||                              \
    ((trigger) == EXINT_TRIGGER_BOTH))

/*! Parameter validity check for EXINT channel. */
#define IS_EXINT_CH(ch)                                                         \
(   ((ch) != 0x00UL)                            &&                              \
    (((ch) | EXINT_CH_MASK) == EXINT_CH_MASK))

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

