RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 * @defgroup INTC_Local_Variable INTC Local Variable
 * @{
 */
static func_ptr_t m_apfnIrqHandler[IRQ_NUM_MAX] = {NULL};
static func_ptr_t m_pfnNmiCallback;
/**
 * @}
 */

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup INTC_Global_Functions INTC Global Functions
 * @{
 */
/**
 * @brief  IRQ sign in function
 * @param  [in] pstcIrqSignConfig: pointer of IRQ registration structure
 *   @arg  enIntSrc: can be any value @ref en_int_src_t
 *   @arg  enIRQn: can be any value from Int000_IRQn ~ Int127_IRQn @ref IRQn_Type
 *   @arg  pfnCallback: Callback function
 * @retval Ok: IRQ register successfully
 *         ErrorInvalidParameter: IRQ No. and Peripheral Int source are not match;
 *                                NULL pointer.
 *         ErrorUninitialized: Specified IRQ entry was signed before.
 */
en_result_t INTC_IrqSignIn(const stc_irq_signin_config_t *pstcIrqSignConfig)
{
    __IO uint32_t *INTC_SELx;
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcIrqSignConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* IRQ032~127 whether out of range */
        if ((((((uint32_t)pstcIrqSignConfig->enIntSrc / 0x20UL) * 6UL + 0x20UL) > (uint32_t)pstcIrqSignConfig->enIRQn) || \
             ((((uint32_t)pstcIrqSignConfig->enIntSrc / 0x20UL) * 6UL + 0x25U) < (uint32_t)pstcIrqSignConfig->enIRQn))&& \
             ((uint32_t)pstcIrqSignConfig->enIRQn >= 0x20UL))
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            INTC_SELx = (__IO uint32_t *)((uint32_t)(&M4_INTC->SEL0) + (4U * (uint32_t)pstcIrqSignConfig->enIRQn));
            /* for MISRAC2004-12.4 */
            if (0x1FFUL == ((*INTC_SELx) & 0x1FFUL))
            {
                WRITE_REG32(*INTC_SELx, pstcIrqSignConfig->enIntSrc);
                m_apfnIrqHandler[pstcIrqSignConfig->enIRQn] = pstcIrqSignConfig->pfnCallback;
            }
            else if ((uint32_t)(pstcIrqSignConfig->enIntSrc) == ((*INTC_SELx) & 0x1FFUL))
            {
                WRITE_REG32(*INTC_SELx, pstcIrqSignConfig->enIntSrc);
                m_apfnIrqHandler[pstcIrqSignConfig->enIRQn] = pstcIrqSignConfig->pfnCallback;
            }
            else
            {
                enRet = ErrorUninitialized;
            }
        }
    }
    return enRet;
}

/**
 * @brief  IRQ sign out function
 * @param  [in] enIRQn: can be any value from Int000_IRQn ~ Int127_IRQn @ref IRQn_Type
 * @retval Ok: IRQ sign out successfully
 *         ErrorInvalidParameter: IRQ No. is out of range
 */
en_result_t INTC_IrqSignOut(IRQn_Type enIRQn)
{
    __IO uint32_t *INTC_SELx;
    en_result_t enRet = Ok;

    if ((enIRQn < Int000_IRQn) || (enIRQn > Int127_IRQn))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        INTC_SELx = (__IO uint32_t *)((uint32_t)(&M4_INTC->SEL0) + (4UL * (uint32_t)enIRQn));
        WRITE_REG32(*INTC_SELx, 0x1FFUL);
        m_apfnIrqHandler[enIRQn] = NULL;
    }
    return enRet;
}

/**
 * @brief  Share IRQ configure
 * @param  [in] enIntSrc: Peripheral interrupt source @ref en_int_src_t
 * @param  [in] enNewState:
 *   @arg  Enable: Enable corresponding peripheral interrupt in share IRQ handler
 *   @arg  Disable: Disable corresponding peripheral interrupt in share IRQ handler
 * @retval Ok: Share IRQ configure successfully
 */
en_result_t INTC_ShareIrqCmd(en_int_src_t enIntSrc, en_functional_state_t enNewState)
{
    __IO uint32_t *INTC_VSSELx;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    INTC_VSSELx = (__IO uint32_t *)(((uint32_t)&M4_INTC->VSSEL128) + (4U * ((uint32_t)enIntSrc / 0x20U)));
    if (Enable == enNewState)
    {
        SET_REG32_BIT(*INTC_VSSELx, (uint32_t)(1UL << ((uint32_t)enIntSrc & 0x1FUL)));
    }
    else
    {
        CLEAR_REG32_BIT(*INTC_VSSELx, (1UL << ((uint32_t)enIntSrc & 0x1FUL)));
    }
    return Ok;
}

/**
 * @brief  Stop mode wake-up source configure
 * @param  [in] u32WakeupSrc: Wake-up source
 *   @arg  INTC_WUPEN_EIRQWUEN
 *   @arg  INTC_WUPEN_EIRQWUEN_0
 *   @arg  INTC_WUPEN_EIRQWUEN_1
 *   @arg  INTC_WUPEN_EIRQWUEN_2
 *   @arg  INTC_WUPEN_EIRQWUEN_3
 *   @arg  INTC_WUPEN_EIRQWUEN_4
 *   @arg  INTC_WUPEN_EIRQWUEN_5
 *   @arg  INTC_WUPEN_EIRQWUEN_6
 *   @arg  INTC_WUPEN_EIRQWUEN_7
 *   @arg  INTC_WUPEN_EIRQWUEN_8
 *   @arg  INTC_WUPEN_EIRQWUEN_9
 *   @arg  INTC_WUPEN_EIRQWUEN_10
 *   @arg  INTC_WUPEN_EIRQWUEN_11
 *   @arg  INTC_WUPEN_EIRQWUEN_12
 *   @arg  INTC_WUPEN_EIRQWUEN_13
 *   @arg  INTC_WUPEN_EIRQWUEN_14
 *   @arg  INTC_WUPEN_EIRQWUEN_15
 *   @arg  INTC_WUPEN_SWDTWUEN
 *   @arg  INTC_WUPEN_PVD1WUEN
 *   @arg  INTC_WUPEN_PVD2WUEN
 *   @arg  INTC_WUPEN_CMPWUEN
 *   @arg  INTC_WUPEN_WKTMWUEN
 *   @arg  INTC_WUPEN_RTCALMWUEN
 *   @arg  INTC_WUPEN_RTCPRDWUEN
 *   @arg  INTC_WUPEN_TMR0GCMWUEN
 *   @arg  INTC_WUPEN_TMR2GCMWUEN
 *   @arg  INTC_WUPEN_TMR2OVFWUEN
 *   @arg  INTC_WUPEN_RXWEN
 *   @arg  INTC_WUPEN_USHWUEN
 *   @arg  INTC_WUPEN_USFWUEN
 *   @arg  INTC_WUPEN_ETHWUEN
 * @param  [in] enNewState
 *   @arg  Enable: Enable corresponding wake up source
 *   @arg  Disable: Disable corresponding wake up source
 * @retval None
 */
void INTC_WakeupSrcCmd(uint32_t u32WakeupSrc, en_functional_state_t enNewState)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_INTC_WKUP_SRC(u32WakeupSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(M4_INTC->WUPEN, u32WakeupSrc);
    }
    else
    {
        CLEAR_REG32_BIT(M4_INTC->WUPEN, u32WakeupSrc);
    }
}

/**
 * @brief  Event or Interrupt output configure
 * @param  [in] u32Event: Event index
 *   @arg  INTC_EVTER_EVTE0
 *   @arg  INTC_EVTER_EVTE1
 *   @arg  INTC_EVTER_EVTE2
 *   @arg  INTC_EVTER_EVTE3
 *   @arg  INTC_EVTER_EVTE4
 *   @arg  INTC_EVTER_EVTE5
 *   @arg  INTC_EVTER_EVTE6
 *   @arg  INTC_EVTER_EVTE7
 *   @arg  INTC_EVTER_EVTE8
 *   @arg  INTC_EVTER_EVTE9
 *   @arg  INTC_EVTER_EVTE10
 *   @arg  INTC_EVTER_EVTE11
 *   @arg  INTC_EVTER_EVTE12
 *   @arg  INTC_EVTER_EVTE13
 *   @arg  INTC_EVTER_EVTE14
 *   @arg  INTC_EVTER_EVTE15
 *   @arg  INTC_EVTER_EVTE16
 *   @arg  INTC_EVTER_EVTE17
 *   @arg  INTC_EVTER_EVTE18
 *   @arg  INTC_EVTER_EVTE19
 *   @arg  INTC_EVTER_EVTE20
 *   @arg  INTC_EVTER_EVTE21
 *   @arg  INTC_EVTER_EVTE22
 *   @arg  INTC_EVTER_EVTE23
 *   @arg  INTC_EVTER_EVTE24
 *   @arg  INTC_EVTER_EVTE25
 *   @arg  INTC_EVTER_EVTE26
 *   @arg  INTC_EVTER_EVTE27
 *   @arg  INTC_EVTER_EVTE28
 *   @arg  INTC_EVTER_EVTE29
 *   @arg  INTC_EVTER_EVTE30
 *   @arg  INTC_EVTER_EVTE31
 * @param  [in] enNewState
 *   @arg  Enable: Enable corresponding event to NVIC
 *   @arg  Disable: Disable corresponding event but interrupt to NVIC
 * @retval None
 */
void INTC_EventCmd(uint32_t u32Event, en_functional_state_t enNewState)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_INTC_EVENT(u32Event));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

