RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
    if (Enable == enNewState)
    {
        SET_REG32_BIT(M4_INTC->EVTER, u32Event);
    }
    else
    {
        CLEAR_REG32_BIT(M4_INTC->EVTER, u32Event);
    }
}

/**
 * @brief  Interrupt function configure
 * @param  [in] u32Int: Interrupt index
 *   @arg  INTC_IER_IER0
 *   @arg  INTC_IER_IER1
 *   @arg  INTC_IER_IER2
 *   @arg  INTC_IER_IER3
 *   @arg  INTC_IER_IER4
 *   @arg  INTC_IER_IER5
 *   @arg  INTC_IER_IER6
 *   @arg  INTC_IER_IER7
 *   @arg  INTC_IER_IER8
 *   @arg  INTC_IER_IER9
 *   @arg  INTC_IER_IER10
 *   @arg  INTC_IER_IER11
 *   @arg  INTC_IER_IER12
 *   @arg  INTC_IER_IER13
 *   @arg  INTC_IER_IER14
 *   @arg  INTC_IER_IER15
 *   @arg  INTC_IER_IER16
 *   @arg  INTC_IER_IER17
 *   @arg  INTC_IER_IER18
 *   @arg  INTC_IER_IER19
 *   @arg  INTC_IER_IER20
 *   @arg  INTC_IER_IER21
 *   @arg  INTC_IER_IER22
 *   @arg  INTC_IER_IER23
 *   @arg  INTC_IER_IER24
 *   @arg  INTC_IER_IER25
 *   @arg  INTC_IER_IER26
 *   @arg  INTC_IER_IER27
 *   @arg  INTC_IER_IER28
 *   @arg  INTC_IER_IER29
 *   @arg  INTC_IER_IER30
 *   @arg  INTC_IER_IER31
 * @param  [in] enNewState
 *   @arg  Enable: Enable corresponding interrupt to NVIC
 *   @arg  Disable: Disable corresponding interrupt to NVIC
 * @retval None
 */
void INTC_IntCmd(uint32_t u32Int, en_functional_state_t enNewState)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_INTC_INT(u32Int));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(M4_INTC->IER, u32Int);
    }
    else
    {
        CLEAR_REG32_BIT(M4_INTC->IER, u32Int);
    }
}

/**
 * @brief  Software Interrupt function configure
 * @param  [in] u32SWI: Software Interrupt index
 *   @arg  INTC_SWIER_SWIE0
 *   @arg  INTC_SWIER_SWIE1
 *   @arg  INTC_SWIER_SWIE2
 *   @arg  INTC_SWIER_SWIE3
 *   @arg  INTC_SWIER_SWIE4
 *   @arg  INTC_SWIER_SWIE5
 *   @arg  INTC_SWIER_SWIE6
 *   @arg  INTC_SWIER_SWIE7
 *   @arg  INTC_SWIER_SWIE8
 *   @arg  INTC_SWIER_SWIE9
 *   @arg  INTC_SWIER_SWIE10
 *   @arg  INTC_SWIER_SWIE11
 *   @arg  INTC_SWIER_SWIE12
 *   @arg  INTC_SWIER_SWIE13
 *   @arg  INTC_SWIER_SWIE14
 *   @arg  INTC_SWIER_SWIE15
 *   @arg  INTC_SWIER_SWIE16
 *   @arg  INTC_SWIER_SWIE17
 *   @arg  INTC_SWIER_SWIE18
 *   @arg  INTC_SWIER_SWIE19
 *   @arg  INTC_SWIER_SWIE20
 *   @arg  INTC_SWIER_SWIE21
 *   @arg  INTC_SWIER_SWIE22
 *   @arg  INTC_SWIER_SWIE23
 *   @arg  INTC_SWIER_SWIE24
 *   @arg  INTC_SWIER_SWIE25
 *   @arg  INTC_SWIER_SWIE26
 *   @arg  INTC_SWIER_SWIE27
 *   @arg  INTC_SWIER_SWIE28
 *   @arg  INTC_SWIER_SWIE29
 *   @arg  INTC_SWIER_SWIE30
 *   @arg  INTC_SWIER_SWIE31
 * @param  [in] enNewState
 *   @arg  Enable: Enable corresponding software interrupt
 *   @arg  Disable: Disable corresponding software interrupt
 * @retval None
 */
void INTC_SWICmd(uint32_t u32SWI, en_functional_state_t enNewState)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_INTC_SWI(u32SWI));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(M4_INTC->SWIER, u32SWI);
    }
    else
    {
        CLEAR_REG32_BIT(M4_INTC->SWIER, u32SWI);
    }
}

/**
 * @brief  Initialize NMI. Fill each pstcNmiInit with default value
 * @param  [in] pstcNmiInit: Pointer to a stc_nmi_init_t structure that
 *                             contains configuration information.
 * @retval Ok: NMI structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t NMI_StructInit(stc_nmi_init_t *pstcNmiInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcNmiInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcNmiInit->u32NmiSrc        = 0UL;
        pstcNmiInit->pfnNmiCallback   = NULL;
    }
    return enRet;
}

/**
 * @brief  Initialize NMI.
 * @param  [in] pstcNmiInit: Pointer to a pstcNmiInit structure that
 *                             contains configuration information.
 * @retval Ok: NMI initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t NMI_Init(const stc_nmi_init_t *pstcNmiInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if ((NULL == pstcNmiInit) || (NULL == pstcNmiInit->pfnNmiCallback))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter validity checking */
        DDL_ASSERT(IS_NMI_SRC(pstcNmiInit->u32NmiSrc));

        /* Clear all NMI trigger source before set */
        WRITE_REG32(M4_INTC->NMICFR, INTC_NMICLR_MASK);

        /* NMI trigger source configure */
        WRITE_REG32(M4_INTC->NMIENR, pstcNmiInit->u32NmiSrc);

        /* NMI callback function configure */
        m_pfnNmiCallback = pstcNmiInit->pfnNmiCallback;
    }
    return enRet;
}

/**
 * @brief  Get NMI trigger source
 * @param  [in] u32NmiSrc: NMI trigger source, @ref NMI_TriggerSrc_Sel for details
 *   @arg  NMI_SRC_SWDT
 *   @arg  NMI_SRC_PVD1
 *   @arg  NMI_SRC_PVD2
 *   @arg  NMI_SRC_XTAL
 *   @arg  NMI_SRC_SRAM_PARITY
 *   @arg  NMI_SRC_SRAM_ECC
 *   @arg  NMI_SRC_BUS_ERR
 *   @arg  NMI_SRC_WDT
 * @retval Set: NMI is triggered by corresponding source
 *         Reset: NMI is not triggered by corresponding source
 */
en_flag_status_t NMI_GetNmiSrc(uint32_t u32NmiSrc)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_NMI_SRC(u32NmiSrc));

    return (((READ_REG32(M4_INTC->NMIFR) & u32NmiSrc)) != 0UL) ? Set : Reset;
}

/**
 * @brief  Set NMI trigger source
 * @param  [in] u32NmiSrc: NMI trigger source, @ref NMI_TriggerSrc_Sel for details
 *   @arg  NMI_SRC_SWDT
 *   @arg  NMI_SRC_PVD1
 *   @arg  NMI_SRC_PVD2
 *   @arg  NMI_SRC_XTAL
 *   @arg  NMI_SRC_SRAM_PARITY
 *   @arg  NMI_SRC_SRAM_ECC
 *   @arg  NMI_SRC_BUS_ERR
 *   @arg  NMI_SRC_WDT
 * @retval None
 */
void NMI_SetNmiSrc(uint32_t u32NmiSrc)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_NMI_SRC(u32NmiSrc));

    WRITE_REG32(M4_INTC->NMIENR, u32NmiSrc);
}

/**
 * @brief  Clear specified NMI trigger source
 * @param  [in] u32NmiSrc: NMI trigger source, @ref NMI_TriggerSrc_Sel for details
 *   @arg  NMI_SRC_SWDT
 *   @arg  NMI_SRC_PVD1
 *   @arg  NMI_SRC_PVD2
 *   @arg  NMI_SRC_XTAL
 *   @arg  NMI_SRC_SRAM_PARITY
 *   @arg  NMI_SRC_SRAM_ECC
 *   @arg  NMI_SRC_BUS_ERR
 *   @arg  NMI_SRC_WDT
 * @retval None
 */
void NMI_ClrNmiSrc(uint32_t u32NmiSrc)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_NMI_SRC(u32NmiSrc));

    SET_REG32_BIT(M4_INTC->NMICFR, u32NmiSrc);
}

/**
 * @brief  NMI IRQ handler
 * @param  None
 * @retval None
 */
void NMI_IrqHandler(void)
{
    if (NULL != m_pfnNmiCallback)
    {
        m_pfnNmiCallback();
    }
}

/**
 * @brief  Initialize External interrupt.
 * @param  [in] pstcExIntInit: Pointer to a stc_exint_init_t structure that
 *                             contains configuration information.
 * @retval Ok:  EXINT initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t EXINT_Init(const stc_exint_init_t *pstcExIntInit)
{
    uint8_t u8ExIntPos;
    en_result_t enRet = Ok;

