RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
    /* Check if pointer is NULL */
    if (NULL == pstcExIntInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter validity checking */
        DDL_ASSERT(IS_EXINT_FAE(pstcExIntInit->u32ExIntFAE));
        DDL_ASSERT(IS_EXINT_FACLK(pstcExIntInit->u32ExIntFAClk));
        DDL_ASSERT(IS_EXINT_FBE(pstcExIntInit->u32ExIntFBE));
        DDL_ASSERT(IS_EXINT_FBTIME(pstcExIntInit->u32ExIntFBTime));
        DDL_ASSERT(IS_EXINT_TRIGGER(pstcExIntInit->u32ExIntLvl));
        DDL_ASSERT(IS_EXINT_CH(pstcExIntInit->u32ExIntCh));

        for (u8ExIntPos = 0U; u8ExIntPos < 16U; u8ExIntPos++)
        {
            if ((pstcExIntInit->u32ExIntCh & (1UL << u8ExIntPos)) != 0U)
            {
                WRITE_REG32(*(uint32_t *)((uint32_t)(&M4_INTC->EIRQCR0) + 4UL*u8ExIntPos),  \
                          (pstcExIntInit->u32ExIntFAE         |                           \
                           pstcExIntInit->u32ExIntFAClk       |                           \
                           pstcExIntInit->u32ExIntFBE         |                           \
                           pstcExIntInit->u32ExIntLvl));
                WRITE_REG32(M4_INTC->NOCCR, pstcExIntInit->u32ExIntFBTime);
            }
        }
    }
    return enRet;
}

/**
 * @brief  Initialize ExInt. Fill each pstcExIntInit with default value
 * @param  [in] pstcExIntInit: Pointer to a stc_exint_init_t structure
 *                              that contains configuration information.
 * @retval Ok: EXINT structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t EXINT_StructInit(stc_exint_init_t *pstcExIntInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcExIntInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcExIntInit->u32ExIntCh     = (uint32_t)0UL;
        pstcExIntInit->u32ExIntFAE    = EXINT_FILTER_A_OFF;
        pstcExIntInit->u32ExIntFAClk  = EXINT_FACLK_HCLK_DIV1;
        pstcExIntInit->u32ExIntFBE    = EXINT_FILTER_B_OFF;
        pstcExIntInit->u32ExIntFBTime = EXINT_FBTIM_500NS;
        pstcExIntInit->u32ExIntLvl    = EXINT_TRIGGER_FALLING;
    }
    return enRet;
}

/**
 * @brief  Clear specified External interrupt trigger source
 * @param  [in] u32ExIntCh: External interrupt channel, @ref EXINT_Channel_Sel for details
 *   @arg  EXINT_CH00
 *   @arg  EXINT_CH01
 *   @arg  EXINT_CH02
 *   @arg  EXINT_CH03
 *   @arg  EXINT_CH04
 *   @arg  EXINT_CH05
 *   @arg  EXINT_CH06
 *   @arg  EXINT_CH07
 *   @arg  EXINT_CH08
 *   @arg  EXINT_CH09
 *   @arg  EXINT_CH10
 *   @arg  EXINT_CH11
 *   @arg  EXINT_CH12
 *   @arg  EXINT_CH13
 *   @arg  EXINT_CH14
 *   @arg  EXINT_CH15
 * @retval None
 */
void EXINT_ClrExIntSrc(uint32_t u32ExIntCh)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_EXINT_CH(u32ExIntCh));

    SET_REG32_BIT(M4_INTC->EICFR, u32ExIntCh);
}

/**
 * @brief  Get specified External interrupt trigger source
 * @param  [in] u32ExIntCh: External interrupt channel, @ref EXINT_Channel_Sel for details
 *   @arg  EXINT_CH00
 *   @arg  EXINT_CH01
 *   @arg  EXINT_CH02
 *   @arg  EXINT_CH03
 *   @arg  EXINT_CH04
 *   @arg  EXINT_CH05
 *   @arg  EXINT_CH06
 *   @arg  EXINT_CH07
 *   @arg  EXINT_CH08
 *   @arg  EXINT_CH09
 *   @arg  EXINT_CH10
 *   @arg  EXINT_CH11
 *   @arg  EXINT_CH12
 *   @arg  EXINT_CH13
 *   @arg  EXINT_CH14
 *   @arg  EXINT_CH15
 * @retval Set: Specified channel of external interrupt is triggered
 *         Reset: Specified channel of external interrupt is not triggered
 */
en_flag_status_t EXINT_GetExIntSrc(uint32_t u32ExIntCh)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_EXINT_CH(u32ExIntCh));

    return ((READ_REG16(M4_INTC->EIFR) & u32ExIntCh) != 0U) ? Set : Reset;
}

/**
 * @brief  NMI IRQ handler
 * @param  None
 * @retval None
 */
void NMI_Handler(void)
{
    NMI_IrqHandler();
}

/**
 * @brief  Hard Fault IRQ handler
 * @param  None
 * @retval None
 */
__WEAKDEF void HardFault_Handler(void)
{
    HardFault_IrqHandler();
}

/**
 * @brief  Mem manage fault IRQ handler
 * @param  None
 * @retval None
 */
void MemManage_Handler(void)
{
    MemManage_IrqHandler();
}

/**
 * @brief  Bus fault IRQ handler
 * @param  None
 * @retval None
 */
void BusFault_Handler(void)
{
    BusFault_IrqHandler();
}

/**
 * @brief  Usage fault IRQ handler
 * @param  None
 * @retval None
 */
void UsageFault_Handler(void)
{
    UsageFault_IrqHandler();
}

/**
 * @brief  SVCall IRQ handler
 * @param  None
 * @retval None
 */
void SVC_Handler(void)
{
    SVC_IrqHandler();
}

/**
 * @brief  Debbug monitor IRQ handler
 * @param  None
 * @retval None
 */
void DebugMon_Handler(void)
{
    DebugMon_IrqHandler();
}

/**
 * @brief  PendSV IRQ handler
 * @param  None
 * @retval None
 */
__WEAKDEF void PendSV_Handler(void)
{
    PendSV_IrqHandler();
}

/**
 * @brief  SysTick IRQ handler
 * @param  None
 * @retval None
 */
__WEAKDEF void SysTick_Handler(void)
{
    SysTick_IrqHandler();
}

/**
 * @brief  Interrupt No.000 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ000_Handler(void)
{
    m_apfnIrqHandler[Int000_IRQn]();
}

/**
 * @brief  Interrupt No.001 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ001_Handler(void)
{
    m_apfnIrqHandler[Int001_IRQn]();
}

/**
 * @brief  Interrupt No.002 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ002_Handler(void)
{
    m_apfnIrqHandler[Int002_IRQn]();
}

/**
 * @brief  Interrupt No.003 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ003_Handler(void)
{
    m_apfnIrqHandler[Int003_IRQn]();
}

/**
 * @brief  Interrupt No.004 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ004_Handler(void)
{
    m_apfnIrqHandler[Int004_IRQn]();
}

/**
 * @brief  Interrupt No.005 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ005_Handler(void)
{
    m_apfnIrqHandler[Int005_IRQn]();
}

/**
 * @brief  Interrupt No.006 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ006_Handler(void)
{
    m_apfnIrqHandler[Int006_IRQn]();
}

/**
 * @brief  Interrupt No.007 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ007_Handler(void)
{
    m_apfnIrqHandler[Int007_IRQn]();
}

/**
 * @brief  Interrupt No.008 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ008_Handler(void)
{
    m_apfnIrqHandler[Int008_IRQn]();
}

/**
 * @brief  Interrupt No.009 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ009_Handler(void)
{
    m_apfnIrqHandler[Int009_IRQn]();
}

/**
 * @brief  Interrupt No.010 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ010_Handler(void)
{
    m_apfnIrqHandler[Int010_IRQn]();
}


/**
 * @brief  Interrupt No.011 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ011_Handler(void)
{
    m_apfnIrqHandler[Int011_IRQn]();
}

/**
 * @brief  Interrupt No.012 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ012_Handler(void)
{
    m_apfnIrqHandler[Int012_IRQn]();
}

/**
 * @brief  Interrupt No.013 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ013_Handler(void)
{
    m_apfnIrqHandler[Int013_IRQn]();
}

/**
 * @brief  Interrupt No.014 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ014_Handler(void)
{
    m_apfnIrqHandler[Int014_IRQn]();
}

/**
 * @brief  Interrupt No.015 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ015_Handler(void)
{
    m_apfnIrqHandler[Int015_IRQn]();
}

/**
 * @brief  Interrupt No.016 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ016_Handler(void)
{
    m_apfnIrqHandler[Int016_IRQn]();
}

/**
 * @brief  Interrupt No.017 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ017_Handler(void)
{
    m_apfnIrqHandler[Int017_IRQn]();
}

/**
 * @brief  Interrupt No.018 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ018_Handler(void)
{
    m_apfnIrqHandler[Int018_IRQn]();
}

/**
 * @brief  Interrupt No.019 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ019_Handler(void)
{
    m_apfnIrqHandler[Int019_IRQn]();
}

/**
 * @brief  Interrupt No.020 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ020_Handler(void)
{
    m_apfnIrqHandler[Int020_IRQn]();
}

/**
 * @brief  Interrupt No.021 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ021_Handler(void)
{
    m_apfnIrqHandler[Int021_IRQn]();
}

/**
 * @brief  Interrupt No.022 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ022_Handler(void)
{
    m_apfnIrqHandler[Int022_IRQn]();
}

/**
 * @brief  Interrupt No.023 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ023_Handler(void)
{
    m_apfnIrqHandler[Int023_IRQn]();
}

/**
 * @brief  Interrupt No.024 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ024_Handler(void)
{
    m_apfnIrqHandler[Int024_IRQn]();
}

/**
 * @brief  Interrupt No.025 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ025_Handler(void)
{
    m_apfnIrqHandler[Int025_IRQn]();
}

/**
 * @brief  Interrupt No.026 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ026_Handler(void)
{
    m_apfnIrqHandler[Int026_IRQn]();
}

/**
 * @brief  Interrupt No.027 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ027_Handler(void)
{
    m_apfnIrqHandler[Int027_IRQn]();
}

/**
 * @brief  Interrupt No.028 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ028_Handler(void)
{
    m_apfnIrqHandler[Int028_IRQn]();
}

/**
 * @brief  Interrupt No.029 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ029_Handler(void)
{
    m_apfnIrqHandler[Int029_IRQn]();
}

/**
 * @brief  Interrupt No.030 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ030_Handler(void)
{
    m_apfnIrqHandler[Int030_IRQn]();
}

/**
 * @brief  Interrupt No.031 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ031_Handler(void)
{
    m_apfnIrqHandler[Int031_IRQn]();
}

/**
 * @brief  Interrupt No.032 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ032_Handler(void)
{
    m_apfnIrqHandler[Int032_IRQn]();
}

/**
 * @brief  Interrupt No.033 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ033_Handler(void)
{
    m_apfnIrqHandler[Int033_IRQn]();
}

/**
 * @brief  Interrupt No.034 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ034_Handler(void)
{
    m_apfnIrqHandler[Int034_IRQn]();
}

/**
 * @brief  Interrupt No.035 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ035_Handler(void)
{
    m_apfnIrqHandler[Int035_IRQn]();
}

/**
 * @brief  Interrupt No.036 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ036_Handler(void)
{
    m_apfnIrqHandler[Int036_IRQn]();
}

/**
 * @brief  Interrupt No.037 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ037_Handler(void)
{
    m_apfnIrqHandler[Int037_IRQn]();
}

/**
 * @brief  Interrupt No.038 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ038_Handler(void)
{
    m_apfnIrqHandler[Int038_IRQn]();
}

/**
 * @brief  Interrupt No.039 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ039_Handler(void)
{
    m_apfnIrqHandler[Int039_IRQn]();
}

/**
 * @brief  Interrupt No.040 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ040_Handler(void)
{
    m_apfnIrqHandler[Int040_IRQn]();
}

/**
 * @brief  Interrupt No.041 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ041_Handler(void)
{
    m_apfnIrqHandler[Int041_IRQn]();
}

/**
 * @brief  Interrupt No.042 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ042_Handler(void)
{
    m_apfnIrqHandler[Int042_IRQn]();
}

/**
 * @brief  Interrupt No.043 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ043_Handler(void)
{
    m_apfnIrqHandler[Int043_IRQn]();
}

/**
 * @brief  Interrupt No.044 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ044_Handler(void)
{
    m_apfnIrqHandler[Int044_IRQn]();
}

/**
 * @brief  Interrupt No.045 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ045_Handler(void)
{
    m_apfnIrqHandler[Int045_IRQn]();
}

/**
 * @brief  Interrupt No.046 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ046_Handler(void)
{
    m_apfnIrqHandler[Int046_IRQn]();
}

/**
 * @brief  Interrupt No.047 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ047_Handler(void)
{
    m_apfnIrqHandler[Int047_IRQn]();
}

/**
 * @brief  Interrupt No.048 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ048_Handler(void)
{
    m_apfnIrqHandler[Int048_IRQn]();
}

/**
 * @brief  Interrupt No.049 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ049_Handler(void)
{
    m_apfnIrqHandler[Int049_IRQn]();
}

/**
 * @brief  Interrupt No.050 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ050_Handler(void)
{
    m_apfnIrqHandler[Int050_IRQn]();
}

/**
 * @brief  Interrupt No.051 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ051_Handler(void)
{
    m_apfnIrqHandler[Int051_IRQn]();
}

/**
 * @brief  Interrupt No.052 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ052_Handler(void)
{
    m_apfnIrqHandler[Int052_IRQn]();
}

/**
 * @brief  Interrupt No.053 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ053_Handler(void)
{
    m_apfnIrqHandler[Int053_IRQn]();
}

/**
 * @brief  Interrupt No.054 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ054_Handler(void)
{
    m_apfnIrqHandler[Int054_IRQn]();
}

/**
 * @brief  Interrupt No.055 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ055_Handler(void)
{
    m_apfnIrqHandler[Int055_IRQn]();
}

/**
 * @brief  Interrupt No.056 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ056_Handler(void)
{
    m_apfnIrqHandler[Int056_IRQn]();
}

/**
 * @brief  Interrupt No.057 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ057_Handler(void)
{
    m_apfnIrqHandler[Int057_IRQn]();
}

/**
 * @brief  Interrupt No.058 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ058_Handler(void)
{
    m_apfnIrqHandler[Int058_IRQn]();
}

/**
 * @brief  Interrupt No.059 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ059_Handler(void)
{
    m_apfnIrqHandler[Int059_IRQn]();
}

/**
 * @brief  Interrupt No.060 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ060_Handler(void)
{
    m_apfnIrqHandler[Int060_IRQn]();
}

/**
 * @brief  Interrupt No.061 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ061_Handler(void)
{
    m_apfnIrqHandler[Int061_IRQn]();
}

/**
 * @brief  Interrupt No.062 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ062_Handler(void)
{
    m_apfnIrqHandler[Int062_IRQn]();
}

/**
 * @brief  Interrupt No.063 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ063_Handler(void)
{
    m_apfnIrqHandler[Int063_IRQn]();
}

/**
 * @brief  Interrupt No.064 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ064_Handler(void)
{
    m_apfnIrqHandler[Int064_IRQn]();
}

/**
 * @brief  Interrupt No.065 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ065_Handler(void)
{
    m_apfnIrqHandler[Int065_IRQn]();
}

/**
 * @brief  Interrupt No.066 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ066_Handler(void)
{
    m_apfnIrqHandler[Int066_IRQn]();
}

/**
 * @brief  Interrupt No.067 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ067_Handler(void)
{
    m_apfnIrqHandler[Int067_IRQn]();
}

/**
 * @brief  Interrupt No.068 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ068_Handler(void)
{
    m_apfnIrqHandler[Int068_IRQn]();
}

/**
 * @brief  Interrupt No.069 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ069_Handler(void)
{
    m_apfnIrqHandler[Int069_IRQn]();
}

/**
 * @brief  Interrupt No.070 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ070_Handler(void)
{
    m_apfnIrqHandler[Int070_IRQn]();
}

/**
 * @brief  Interrupt No.071 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ071_Handler(void)
{
    m_apfnIrqHandler[Int071_IRQn]();
}

/**
 * @brief  Interrupt No.072 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ072_Handler(void)
{
    m_apfnIrqHandler[Int072_IRQn]();
}

/**
 * @brief  Interrupt No.073 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ073_Handler(void)
{
    m_apfnIrqHandler[Int073_IRQn]();
}

/**
 * @brief  Interrupt No.074 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ074_Handler(void)
{
    m_apfnIrqHandler[Int074_IRQn]();
}

/**
 * @brief  Interrupt No.075 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ075_Handler(void)
{
    m_apfnIrqHandler[Int075_IRQn]();
}

/**
 * @brief  Interrupt No.076 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ076_Handler(void)
{
    m_apfnIrqHandler[Int076_IRQn]();
}

/**
 * @brief  Interrupt No.077 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ077_Handler(void)
{
    m_apfnIrqHandler[Int077_IRQn]();
}

/**
 * @brief  Interrupt No.078 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ078_Handler(void)
{
    m_apfnIrqHandler[Int078_IRQn]();
}

/**
 * @brief  Interrupt No.079 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ079_Handler(void)
{
    m_apfnIrqHandler[Int079_IRQn]();
}

/**
 * @brief  Interrupt No.080 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ080_Handler(void)
{
    m_apfnIrqHandler[Int080_IRQn]();
}

/**
 * @brief  Interrupt No.081 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ081_Handler(void)
{
    m_apfnIrqHandler[Int081_IRQn]();
}

/**
 * @brief  Interrupt No.082 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ082_Handler(void)
{
    m_apfnIrqHandler[Int082_IRQn]();
}

/**
 * @brief  Interrupt No.083 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ083_Handler(void)
{
    m_apfnIrqHandler[Int083_IRQn]();
}

/**
 * @brief  Interrupt No.084 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ084_Handler(void)
{
    m_apfnIrqHandler[Int084_IRQn]();
}

/**
 * @brief  Interrupt No.085 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ085_Handler(void)
{
    m_apfnIrqHandler[Int085_IRQn]();
}

/**
 * @brief  Interrupt No.086 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ086_Handler(void)
{
    m_apfnIrqHandler[Int086_IRQn]();
}

/**
 * @brief  Interrupt No.087 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ087_Handler(void)
{
    m_apfnIrqHandler[Int087_IRQn]();
}

/**
 * @brief  Interrupt No.088 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ088_Handler(void)
{
    m_apfnIrqHandler[Int088_IRQn]();
}

/**
 * @brief  Interrupt No.089 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ089_Handler(void)
{
    m_apfnIrqHandler[Int089_IRQn]();
}

/**
 * @brief  Interrupt No.090 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ090_Handler(void)
{
    m_apfnIrqHandler[Int090_IRQn]();
}

/**
 * @brief  Interrupt No.091 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ091_Handler(void)
{
    m_apfnIrqHandler[Int091_IRQn]();
}

/**
 * @brief  Interrupt No.092 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ092_Handler(void)
{
    m_apfnIrqHandler[Int092_IRQn]();
}

/**
 * @brief  Interrupt No.093 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ093_Handler(void)
{
    m_apfnIrqHandler[Int093_IRQn]();
}

/**
 * @brief  Interrupt No.094 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ094_Handler(void)
{
    m_apfnIrqHandler[Int094_IRQn]();
}

/**
 * @brief  Interrupt No.095 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ095_Handler(void)
{
    m_apfnIrqHandler[Int095_IRQn]();
}

/**
 * @brief  Interrupt No.096 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ096_Handler(void)
{
    m_apfnIrqHandler[Int096_IRQn]();
}

/**
 * @brief  Interrupt No.097 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ097_Handler(void)
{
    m_apfnIrqHandler[Int097_IRQn]();
}

/**
 * @brief  Interrupt No.098 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ098_Handler(void)
{
    m_apfnIrqHandler[Int098_IRQn]();
}

/**
 * @brief  Interrupt No.099 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ099_Handler(void)
{
    m_apfnIrqHandler[Int099_IRQn]();
}

/**
 * @brief  Interrupt No.100 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ100_Handler(void)
{
    m_apfnIrqHandler[Int100_IRQn]();
}

/**
 * @brief  Interrupt No.101 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ101_Handler(void)
{
    m_apfnIrqHandler[Int101_IRQn]();
}

/**
 * @brief  Interrupt No.102 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ102_Handler(void)
{
    m_apfnIrqHandler[Int102_IRQn]();
}

/**
 * @brief  Interrupt No.103 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ103_Handler(void)
{
    m_apfnIrqHandler[Int103_IRQn]();
}

/**
 * @brief  Interrupt No.104 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ104_Handler(void)
{
    m_apfnIrqHandler[Int104_IRQn]();
}

/**
 * @brief  Interrupt No.105 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ105_Handler(void)
{
    m_apfnIrqHandler[Int105_IRQn]();
}

/**
 * @brief  Interrupt No.106 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ106_Handler(void)
{
    m_apfnIrqHandler[Int106_IRQn]();
}

/**
 * @brief  Interrupt No.107 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ107_Handler(void)
{
    m_apfnIrqHandler[Int107_IRQn]();
}

/**
 * @brief  Interrupt No.108 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ108_Handler(void)
{
    m_apfnIrqHandler[Int108_IRQn]();
}

/**
 * @brief  Interrupt No.109 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ109_Handler(void)
{
    m_apfnIrqHandler[Int109_IRQn]();
}

/**
 * @brief  Interrupt No.110 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ110_Handler(void)
{
    m_apfnIrqHandler[Int110_IRQn]();
}

/**
 * @brief  Interrupt No.111 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ111_Handler(void)
{
    m_apfnIrqHandler[Int111_IRQn]();
}

/**
 * @brief  Interrupt No.112 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ112_Handler(void)
{
    m_apfnIrqHandler[Int112_IRQn]();
}

/**
 * @brief  Interrupt No.113 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ113_Handler(void)
{
    m_apfnIrqHandler[Int113_IRQn]();
}

/**
 * @brief  Interrupt No.114 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ114_Handler(void)
{
    m_apfnIrqHandler[Int114_IRQn]();
}

/**
 * @brief  Interrupt No.115 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ115_Handler(void)
{
    m_apfnIrqHandler[Int115_IRQn]();
}

/**
 * @brief  Interrupt No.116 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ116_Handler(void)
{
    m_apfnIrqHandler[Int116_IRQn]();
}

/**
 * @brief  Interrupt No.117 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ117_Handler(void)
{
    m_apfnIrqHandler[Int117_IRQn]();
}

/**
 * @brief  Interrupt No.118 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ118_Handler(void)
{
    m_apfnIrqHandler[Int118_IRQn]();
}

/**
 * @brief  Interrupt No.119 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ119_Handler(void)
{
    m_apfnIrqHandler[Int119_IRQn]();
}

/**
 * @brief  Interrupt No.120 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ120_Handler(void)
{
    m_apfnIrqHandler[Int120_IRQn]();
}

/**
 * @brief  Interrupt No.121 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ121_Handler(void)
{
    m_apfnIrqHandler[Int121_IRQn]();
}

/**
 * @brief  Interrupt No.122 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ122_Handler(void)
{
    m_apfnIrqHandler[Int122_IRQn]();
}

/**
 * @brief  Interrupt No.123 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ123_Handler(void)
{
    m_apfnIrqHandler[Int123_IRQn]();
}

/**
 * @brief  Interrupt No.124 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ124_Handler(void)
{
    m_apfnIrqHandler[Int124_IRQn]();
}

/**
 * @brief  Interrupt No.125 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ125_Handler(void)
{
    m_apfnIrqHandler[Int125_IRQn]();
}

/**
 * @brief  Interrupt No.126 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ126_Handler(void)
{
    m_apfnIrqHandler[Int126_IRQn]();
}

/**
 * @brief  Interrupt No.127 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ127_Handler(void)
{
    m_apfnIrqHandler[Int127_IRQn]();
}

