RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
/**
 * @brief  Interrupt No.128 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ128_Handler(void)
{
    const uint32_t VSSEL128 = M4_INTC->VSSEL128;

    /* external interrupt 00 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR0) && (0UL != (VSSEL128 & BIT_MASK_00)))
    {
        EXTINT_00_IrqHandler();
    }
    /* external interrupt 01 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR1) && (0UL != (VSSEL128 & BIT_MASK_01)))
    {
        EXTINT_01_IrqHandler();
    }
    /* external interrupt 02 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR2) && (0UL != (VSSEL128 & BIT_MASK_02)))
    {
        EXTINT_02_IrqHandler();
    }
    /* external interrupt 03 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR3) && (0UL != (VSSEL128 & BIT_MASK_03)))
    {
        EXTINT_03_IrqHandler();
    }
    /* external interrupt 04 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR4) && (0UL != (VSSEL128 & BIT_MASK_04)))
    {
        EXTINT_04_IrqHandler();
    }
    /* external interrupt 05 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR5) && (0UL != (VSSEL128 & BIT_MASK_05)))
    {
        EXTINT_05_IrqHandler();
    }
    /* external interrupt 06 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR6) && (0UL != (VSSEL128 & BIT_MASK_06)))
    {
        EXTINT_06_IrqHandler();
    }
    /* external interrupt 07 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR7) && (0UL != (VSSEL128 & BIT_MASK_07)))
    {
        EXTINT_07_IrqHandler();
    }
    /* external interrupt 08 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR8) && (0UL != (VSSEL128 & BIT_MASK_08)))
    {
        EXTINT_08_IrqHandler();
    }
    /* external interrupt 09 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR9) && (0UL != (VSSEL128 & BIT_MASK_09)))
    {
        EXTINT_09_IrqHandler();
    }
    /* external interrupt 10 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR10) && (0UL != (VSSEL128 & BIT_MASK_10)))
    {
        EXTINT_10_IrqHandler();
    }
    /* external interrupt 11 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR11) && (0UL != (VSSEL128 & BIT_MASK_11)))
    {
        EXTINT_11_IrqHandler();
    }
    /* external interrupt 12 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR12) && (0UL != (VSSEL128 & BIT_MASK_12)))
    {
        EXTINT_12_IrqHandler();
    }
    /* external interrupt 13 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR13) && (0UL != (VSSEL128 & BIT_MASK_13)))
    {
        EXTINT_13_IrqHandler();
    }
    /* external interrupt 14 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR14) && (0UL != (VSSEL128 & BIT_MASK_14)))
    {
        EXTINT_14_IrqHandler();
    }
    /* external interrupt 15 */
    if ((1UL == bM4_INTC->EIFR_b.EIFR15) && (0UL != (VSSEL128 & BIT_MASK_15)))
    {
        EXTINT_15_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.129 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ129_Handler(void)
{
    const uint32_t VSSEL129 = M4_INTC->VSSEL129;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

    /* DMA1 Ch.0 interrupt enabled */
    if (1UL == bM4_DMA1->CHCTL0_b.IE)
    {
        /* DMA1 Ch.0 Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKTC0)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.TC0) && (0UL != (VSSEL129 & BIT_MASK_00)))
            {
                DMA_1_Tc0_IrqHandler();
            }
        }
        /* DMA1 ch.0 Block Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKBTC0)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.BTC0) && (0UL != (VSSEL129 & BIT_MASK_08)))
            {
                DMA_1_Btc0_IrqHandler();
            }
        }
        /* DMA1 ch.0 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & (BIT_MASK_00 | BIT_MASK_16);
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & (BIT_MASK_00 | BIT_MASK_16));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16)))
        {
            DMA_1_Err0_IrqHandler();
        }
    }
    /* DMA1 Ch.1 interrupt enabled */
    if (1UL == bM4_DMA1->CHCTL1_b.IE)
    {
        /* DMA1 Ch.1 Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKTC1)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.TC1) && (0UL != (VSSEL129 & BIT_MASK_01)))
            {
                DMA_1_Tc1_IrqHandler();
            }
        }
        /* DMA1 ch.1 Block Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKBTC1)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.BTC1) && (0UL != (VSSEL129 & BIT_MASK_09)))
            {
                DMA_1_Btc1_IrqHandler();
            }
        }
        /* DMA1 ch.1 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & (BIT_MASK_01 | BIT_MASK_17);
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & (BIT_MASK_01 | BIT_MASK_17));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16)))
        {
            DMA_1_Err1_IrqHandler();
        }
    }
    /* DMA1 Ch.2 interrupt enabled */
    if (1UL == bM4_DMA1->CHCTL2_b.IE)
    {
        /* DMA1 Ch.2 Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKTC2)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.TC2) && (0UL != (VSSEL129 & BIT_MASK_02)))
            {
                DMA_1_Tc2_IrqHandler();
            }
        }
        /* DMA1 ch.2 Block Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKBTC2)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.BTC2) && (0UL != (VSSEL129 & BIT_MASK_10)))
            {
                DMA_1_Btc2_IrqHandler();
            }
        }
        /* DMA1 ch.2 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & (BIT_MASK_02 | BIT_MASK_18);
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & (BIT_MASK_02 | BIT_MASK_18));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16)))
        {
            DMA_1_Err2_IrqHandler();
        }
    }
    /* DMA1 Ch.3 interrupt enabled */
    if (1UL == bM4_DMA1->CHCTL3_b.IE)
    {
        /* DMA1 Ch.3 Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKTC3)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.TC3) && (0UL != (VSSEL129 & BIT_MASK_03)))
            {
                DMA_1_Tc3_IrqHandler();
            }
        }
        /* DMA1 ch.3 Block Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKBTC3)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.BTC3) && (0UL != (VSSEL129 & BIT_MASK_11)))
            {
                DMA_1_Btc3_IrqHandler();
            }
        }
        /* DMA1 ch.3 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & (BIT_MASK_03 | BIT_MASK_19);
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & (BIT_MASK_03 | BIT_MASK_19));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16)))
        {
            DMA_1_Err3_IrqHandler();
        }
    }
    /* DMA1 Ch.4 interrupt enabled */
    if (1UL == bM4_DMA1->CHCTL4_b.IE)
    {
        /* DMA1 Ch.4 Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKTC4)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.TC4) && (0UL != (VSSEL129 & BIT_MASK_04)))
            {
                DMA_1_Tc4_IrqHandler();
            }
        }
        /* DMA1 ch.4 Block Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKBTC4)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.BTC4) && (0UL != (VSSEL129 & BIT_MASK_12)))
            {
                DMA_1_Btc4_IrqHandler();
            }
        }
        /* DMA1 ch.4 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & (BIT_MASK_04 | BIT_MASK_20);
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & (BIT_MASK_04 | BIT_MASK_20));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16)))
        {
            DMA_1_Err4_IrqHandler();
        }
    }
    /* DMA1 Ch.5 interrupt enabled */
    if (1UL == bM4_DMA1->CHCTL5_b.IE)
    {
        /* DMA1 Ch.5 Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKTC5)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.TC5) && (0UL != (VSSEL129 & BIT_MASK_05)))
            {
                DMA_1_Tc5_IrqHandler();
            }
        }
        /* DMA1 ch.5 Block Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKBTC5)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.BTC5) && (0UL != (VSSEL129 & BIT_MASK_13)))
            {
                DMA_1_Btc5_IrqHandler();
            }
        }
        /* DMA1 ch.5 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & (BIT_MASK_05 | BIT_MASK_21);
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & (BIT_MASK_05 | BIT_MASK_21));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16)))
        {
            DMA_1_Err5_IrqHandler();
        }
    }
    /* DMA1 Ch.6 interrupt enabled */
    if (1UL == bM4_DMA1->CHCTL6_b.IE)
    {
        /* DMA1 Ch.6 Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKTC6)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.TC6) && (0UL != (VSSEL129 & BIT_MASK_06)))
            {
                DMA_1_Tc6_IrqHandler();
            }
        }
        /* DMA1 ch.6 Block Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKBTC6)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.BTC6) && (0UL != (VSSEL129 & BIT_MASK_14)))
            {
                DMA_1_Btc6_IrqHandler();
            }
        }
        /* DMA1 ch.6 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & (BIT_MASK_06 | BIT_MASK_22);
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & (BIT_MASK_06 | BIT_MASK_22));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16)))
        {
            DMA_1_Err6_IrqHandler();
        }
    }
    /* DMA1 Ch.7 interrupt enabled */
    if (1UL == bM4_DMA1->CHCTL7_b.IE)
    {
        /* DMA1 Ch.7 Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKTC7)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.TC7) && (0UL != (VSSEL129 & BIT_MASK_07)))
            {
                DMA_1_Tc7_IrqHandler();
            }
        }
        /* DMA1 ch.7 Block Tx completed */
        if (0UL == bM4_DMA1->INTMASK1_b.MSKBTC7)
        {
            if ((1UL == bM4_DMA1->INTSTAT1_b.BTC7) && (0UL != (VSSEL129 & BIT_MASK_15)))
            {
                DMA_1_Btc7_IrqHandler();
            }
        }
        /* DMA1 ch.7 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & (BIT_MASK_07 | BIT_MASK_22);
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & (BIT_MASK_07 | BIT_MASK_22));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16)))
        {
            DMA_1_Err7_IrqHandler();
        }
    }
    /* EFM error */
    if (0UL != bM4_EFM->FITE_b.PEERRITE)
    {
        /* EFM program/erase/protect/otp error */
        u32Tmp1 = M4_EFM->FSR & (EFM_FSR_PRTWERR0 | EFM_FSR_PGSZERR0 | EFM_FSR_MISMTCH0 |   \
                                 EFM_FSR_PRTWERR1 | EFM_FSR_PGSZERR1 | EFM_FSR_MISMTCH1 |   \
                                 EFM_FSR_OTPWERR0);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL129 & BIT_MASK_17)))
        {
            EFM_PgmEraseErr_IrqHandler();
        }
    }
    /* EFM read collision */
    if (0UL != bM4_EFM->FITE_b.COLERRITE)
    {
        /* EFM read collision */
        u32Tmp1 = M4_EFM->FSR & (EFM_FSR_COLERR0 | EFM_FSR_COLERR1);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL129 & BIT_MASK_18)))
        {
            EFM_ColErr_IrqHandler();
        }
    }
    /* EFM operate end */
    if (0UL != bM4_EFM->FITE_b.OPTENDITE)
    {
        /* EFM operate end */
        u32Tmp1 = M4_EFM->FSR & (EFM_FSR_OPTEND0 | EFM_FSR_OPTEND1);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL129 & BIT_MASK_19)))
        {
            EFM_OpEnd_IrqHandler();
        }
    }
    /* QSPI access error */
    u32Tmp1 = M4_QSPI->SR & QSPI_SR_RAER;
    if ((0UL != u32Tmp1) && (0UL != (VSSEL129 & BIT_MASK_22)))
    {
        QSPI_Err_IrqHandler();
    }
    /*DCU1 */
    u32Tmp1 = M4_DCU1->INTEVTSEL;
    u32Tmp2 = M4_DCU1->FLAG;
    if ((0UL != ((u32Tmp1) & (u32Tmp2) & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_23)))
    {
        DCU_1_IrqHandler();
    }
    /*DCU2 */
    u32Tmp1 = M4_DCU2->INTEVTSEL;
    u32Tmp2 = M4_DCU2->FLAG;
    if ((0UL != ((u32Tmp1) & (u32Tmp2) & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_24)))
    {
        DCU_2_IrqHandler();
    }
    /*DCU3 */
    u32Tmp1 = M4_DCU3->INTEVTSEL;
    u32Tmp2 = M4_DCU3->FLAG;
    if ((0UL != ((u32Tmp1) & (u32Tmp2) & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_25)))
    {
        DCU_3_IrqHandler();
    }
    /*DCU4 */
    u32Tmp1 = M4_DCU4->INTEVTSEL;
    u32Tmp2 = M4_DCU4->FLAG;
    if ((0UL != ((u32Tmp1) & (u32Tmp2) & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_26)))
    {
        DCU_4_IrqHandler();
    }
    /*DCU5 */
    u32Tmp1 = M4_DCU5->INTEVTSEL;
    u32Tmp2 = M4_DCU5->FLAG;
    if ((0UL != ((u32Tmp1) & (u32Tmp2) & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_27)))
    {
        DCU_5_IrqHandler();
    }
    /*DCU6 */
    u32Tmp1 = M4_DCU6->INTEVTSEL;
    u32Tmp2 = M4_DCU6->FLAG;
    if ((0UL != ((u32Tmp1) & (u32Tmp2) & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_28)))
    {
        DCU_6_IrqHandler();
    }
    /*DCU7 */
    u32Tmp1 = M4_DCU7->INTEVTSEL;
    u32Tmp2 = M4_DCU7->FLAG;
    if ((0UL != ((u32Tmp1) & (u32Tmp2) & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_29)))
    {
        DCU_7_IrqHandler();
    }
    /*DCU8 */
    u32Tmp1 = M4_DCU8->INTEVTSEL;
    u32Tmp2 = M4_DCU8->FLAG;
    if ((0UL != ((u32Tmp1) & (u32Tmp2) & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_30)))
    {
        DCU_8_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.130 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ130_Handler(void)
{
    const uint32_t VSSEL130 = M4_INTC->VSSEL130;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

