RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
    /* MAU square */
    if (0UL != (VSSEL130 & BIT_MASK_19))
    {
        MAU_Sqrt_IrqHandler();
    }
    else
    {
        /* DMA2 Ch.0 interrupt enabled */
        if (1UL == bM4_DMA2->CHCTL0_b.IE)
        {
            /* DMA2 Ch.0 Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKTC0)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.TC0) && (0UL != (VSSEL130 & BIT_MASK_00)))
                {
                    DMA_2_Tc0_IrqHandler();
                }
            }
            /* DMA2 ch.0 Block Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKBTC0)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.BTC0) && (0UL != (VSSEL130 & BIT_MASK_08)))
                {
                    DMA_2_Btc0_IrqHandler();
                }
            }
            /* DMA2 ch.0 Transfer/Request Error */
            u32Tmp1 = M4_DMA2->INTSTAT0 & (BIT_MASK_00 | BIT_MASK_16);
            u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & (BIT_MASK_00 | BIT_MASK_16));
            if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL130 & BIT_MASK_16)))
            {
                DMA_2_Err0_IrqHandler();
            }
        }
        /* DMA2 Ch.1 interrupt enabled */
        if (1UL == bM4_DMA2->CHCTL1_b.IE)
        {
            /* DMA2 Ch.1 Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKTC1)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.TC1) && (0UL != (VSSEL130 & BIT_MASK_01)))
                {
                    DMA_2_Tc1_IrqHandler();
                }
            }
            /* DMA2 ch.1 Block Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKBTC1)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.BTC1) && (0UL != (VSSEL130 & BIT_MASK_09)))
                {
                    DMA_2_Btc1_IrqHandler();
                }
            }
            /* DMA2 ch.1 Transfer/Request Error */
            u32Tmp1 = M4_DMA2->INTSTAT0 & (BIT_MASK_01 | BIT_MASK_17);
            u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & (BIT_MASK_01 | BIT_MASK_17));
            if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL130 & BIT_MASK_16)))
            {
                DMA_2_Err1_IrqHandler();
            }
        }
        /* DMA2 Ch.2 interrupt enabled */
        if (1UL == bM4_DMA2->CHCTL2_b.IE)
        {
            /* DMA2 Ch.2 Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKTC2)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.TC2) && (0UL != (VSSEL130 & BIT_MASK_02)))
                {
                    DMA_2_Tc2_IrqHandler();
                }
            }
            /* DMA2 ch.2 Block Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKBTC2)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.BTC2) && (0UL != (VSSEL130 & BIT_MASK_10)))
                {
                    DMA_2_Btc2_IrqHandler();
                }
            }
            /* DMA2 ch.2 Transfer/Request Error */
            u32Tmp1 = M4_DMA2->INTSTAT0 & (BIT_MASK_02 | BIT_MASK_18);
            u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & (BIT_MASK_02 | BIT_MASK_18));
            if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL130 & BIT_MASK_16)))
            {
                DMA_2_Err2_IrqHandler();
            }
        }
        /* DMA2 Ch.3 interrupt enabled */
        if (1UL == bM4_DMA2->CHCTL3_b.IE)
        {
            /* DMA2 Ch.3 Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKTC3)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.TC3) && (0UL != (VSSEL130 & BIT_MASK_03)))
                {
                    DMA_2_Tc3_IrqHandler();
                }
            }
            /* DMA2 ch.3 Block Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKBTC3)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.BTC3) && (0UL != (VSSEL130 & BIT_MASK_11)))
                {
                    DMA_2_Btc3_IrqHandler();
                }
            }
            /* DMA2 ch.3 Transfer/Request Error */
            u32Tmp1 = M4_DMA2->INTSTAT0 & (BIT_MASK_03 | BIT_MASK_19);
            u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & (BIT_MASK_03 | BIT_MASK_19));
            if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL130 & BIT_MASK_16)))
            {
                DMA_2_Err3_IrqHandler();
            }
        }
        /* DMA2 Ch.4 interrupt enabled */
        if (1UL == bM4_DMA2->CHCTL4_b.IE)
        {
            /* DMA2 Ch.4 Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKTC4)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.TC4) && (0UL != (VSSEL130 & BIT_MASK_04)))
                {
                    DMA_2_Tc4_IrqHandler();
                }
            }
            /* DMA2 ch.4 Block Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKBTC4)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.BTC4) && (0UL != (VSSEL130 & BIT_MASK_12)))
                {
                    DMA_2_Btc4_IrqHandler();
                }
            }
            /* DMA2 ch.4 Transfer/Request Error */
            u32Tmp1 = M4_DMA2->INTSTAT0 & (BIT_MASK_04 | BIT_MASK_20);
            u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & (BIT_MASK_04 | BIT_MASK_20));
            if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL130 & BIT_MASK_16)))
            {
                DMA_2_Err4_IrqHandler();
            }
        }
        /* DMA2 Ch.5 interrupt enabled */
        if (1UL == bM4_DMA2->CHCTL5_b.IE)
        {
            /* DMA2 Ch.5 Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKTC5)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.TC5) && (0UL != (VSSEL130 & BIT_MASK_05)))
                {
                    DMA_2_Tc5_IrqHandler();
                }
            }
            /* DMA2 ch.5 Block Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKBTC5)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.BTC5) && (0UL != (VSSEL130 & BIT_MASK_13)))
                {
                    DMA_2_Btc5_IrqHandler();
                }
            }
            /* DMA2 ch.5 Transfer/Request Error */
            u32Tmp1 = M4_DMA2->INTSTAT0 & (BIT_MASK_05 | BIT_MASK_21);
            u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & (BIT_MASK_05 | BIT_MASK_21));
            if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL130 & BIT_MASK_16)))
            {
                DMA_2_Err5_IrqHandler();
            }
        }
        /* DMA2 Ch.6 interrupt enabled */
        if (1UL == bM4_DMA2->CHCTL6_b.IE)
        {
            /* DMA2 Ch.6 Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKTC6)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.TC6) && (0UL != (VSSEL130 & BIT_MASK_06)))
                {
                    DMA_2_Tc6_IrqHandler();
                }
            }
            /* DMA2 ch.6 Block Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKBTC6)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.BTC6) && (0UL != (VSSEL130 & BIT_MASK_14)))
                {
                    DMA_2_Btc6_IrqHandler();
                }
            }
            /* DMA2 ch.6 Transfer/Request Error */
            u32Tmp1 = M4_DMA2->INTSTAT0 & (BIT_MASK_06 | BIT_MASK_22);
            u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & (BIT_MASK_06 | BIT_MASK_22));
            if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL130 & BIT_MASK_16)))
            {
                DMA_2_Err6_IrqHandler();
            }
        }
        /* DMA2 Ch.7 interrupt enabled */
        if (1UL == bM4_DMA2->CHCTL7_b.IE)
        {
            /* DMA2 Ch.7 Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKTC7)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.TC7) && (0UL != (VSSEL130 & BIT_MASK_07)))
                {
                    DMA_2_Tc7_IrqHandler();
                }
            }
            /* DMA2 ch.7 Block Tx completed */
            if (0UL == bM4_DMA2->INTMASK1_b.MSKBTC7)
            {
                if ((1UL == bM4_DMA2->INTSTAT1_b.BTC7) && (0UL != (VSSEL130 & BIT_MASK_15)))
                {
                    DMA_2_Btc7_IrqHandler();
                }
            }
            /* DMA2 ch.7 Transfer/Request Error */
            u32Tmp1 = M4_DMA2->INTSTAT0 & (BIT_MASK_07 | BIT_MASK_22);
            u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & (BIT_MASK_07 | BIT_MASK_22));
            if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL130 & BIT_MASK_16)))
            {
                DMA_2_Err7_IrqHandler();
            }
        }
        /* DVP frame start */
        if (1UL == bM4_DVP->IER_b.FSIEN)
        {
            if ((1UL == bM4_DVP->STR_b.FSF) && (0UL != (VSSEL130 & BIT_MASK_20)))
            {
                DVP_FrameStart_IrqHandler();
            }
        }
        /* DVP line start */
        if (1UL == bM4_DVP->IER_b.LSIEN)
        {
            if ((1UL == bM4_DVP->STR_b.LSF) && (0UL != (VSSEL130 & BIT_MASK_21)))
            {
                DVP_LineStart_IrqHandler();
            }
        }
        /* DVP line end */
        if (1UL == bM4_DVP->IER_b.LEIEN)
        {
            if ((1UL == bM4_DVP->STR_b.LEF) && (0UL != (VSSEL130 & BIT_MASK_22)))
            {
                DVP_LineEnd_IrqHandler();
            }
        }
        /* DVP frame end */
        if (1UL == bM4_DVP->IER_b.FEIEN)
        {
            if ((1UL == bM4_DVP->STR_b.FEF) && (0UL != (VSSEL130 & BIT_MASK_23)))
            {
                DVP_FrameEnd_IrqHandler();
            }
        }
        /* DVP software sync err */
        if (1UL == bM4_DVP->IER_b.SQUERIEN)
        {
            if ((1UL == bM4_DVP->STR_b.SQUERF) && (0UL != (VSSEL130 & BIT_MASK_24)))
            {
                DVP_SwSyncErr_IrqHandler();
            }
        }
        /* DVP fifo overfolw err */
        if (1UL == bM4_DVP->IER_b.FIFOERIEN)
        {
            if ((1UL == bM4_DVP->STR_b.FIFOERF) && (0UL != (VSSEL130 & BIT_MASK_25)))
            {
                DVP_FifoErr_IrqHandler();
            }
        }
        /* FMAC 1 */
        if (1UL == bM4_FMAC1->IER_b.INTEN)
        {
            if ((1UL == bM4_FMAC1->STR_b.READY) && (0UL != (VSSEL130 & BIT_MASK_27)))
            {
                FMAC_1_IrqHandler();
            }
        }
        /* FMAC 2 */
        if (1UL == bM4_FMAC2->IER_b.INTEN)
        {
            if ((1UL == bM4_FMAC2->STR_b.READY) && (0UL != (VSSEL130 & BIT_MASK_28)))
            {
                FMAC_2_IrqHandler();
            }
        }
        /* FMAC 3 */
        if (1UL == bM4_FMAC3->IER_b.INTEN)
        {
            if ((1UL == bM4_FMAC3->STR_b.READY) && (0UL != (VSSEL130 & BIT_MASK_29)))
            {
                FMAC_3_IrqHandler();
            }
        }
        /* FMAC 4 */
        if (1UL == bM4_FMAC4->IER_b.INTEN)
        {
            if ((1UL == bM4_FMAC4->STR_b.READY) && (0UL != (VSSEL130 & BIT_MASK_30)))
            {
                FMAC_4_IrqHandler();
            }
        }
    }
}

/**
 * @brief  Interrupt No.131 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ131_Handler(void)
{
    const uint32_t VSSEL131 = M4_INTC->VSSEL131;
    uint32_t u32Tmp1;

    /* Timer0 unit1, Ch.A compare match */
    if (1UL == bM4_TMR0_1->BCONR_b.INTENA)
    {
        if ((1UL ==bM4_TMR0_1->STFLR_b.CMFA) && (0UL != (VSSEL131 & BIT_MASK_00)))
        {
            TMR0_1_CmpA_IrqHandler();
        }
    }
    /* Timer0 unit1, Ch.B compare match */
    if (1UL == bM4_TMR0_1->BCONR_b.INTENB)
    {
        if ((1UL ==bM4_TMR0_1->STFLR_b.CMFB) && (0UL != (VSSEL131 & BIT_MASK_01)))
        {
            TMR0_1_CmpB_IrqHandler();
        }
    }
    /* Timer0 unit2, Ch.A compare match */
    if (1UL == bM4_TMR0_2->BCONR_b.INTENA)
    {
        if ((1UL ==bM4_TMR0_2->STFLR_b.CMFA) && (0UL != (VSSEL131 & BIT_MASK_02)))
        {
            TMR0_2_CmpA_IrqHandler();
        }
    }
    /* Timer0 unit2, Ch.B compare match */
    if (1UL == bM4_TMR0_2->BCONR_b.INTENB)
    {
        if ((1UL ==bM4_TMR0_2->STFLR_b.CMFB) && (0UL != (VSSEL131 & BIT_MASK_03)))
        {
            TMR0_2_CmpB_IrqHandler();
        }
    }
    /* Timer2 unit1, Ch.A compare match */
    if (1UL == bM4_TMR2_1->ICONR_b.CMENA)
    {
        if ((1UL == bM4_TMR2_1->STFLR_b.CMFA) && (0UL != (VSSEL131 & BIT_MASK_04)))
        {
            TMR2_1_CmpA_IrqHandler();
        }
    }
    /* Timer2 unit1, Ch.B compare match */
    if (1UL == bM4_TMR2_1->ICONR_b.CMENB)
    {
        if ((1UL == bM4_TMR2_1->STFLR_b.CMFB) && (0UL != (VSSEL131 & BIT_MASK_05)))
        {
            TMR2_1_CmpB_IrqHandler();
        }
    }
    /* Timer2 unit1, Ch.A overflow */
    if (1UL == bM4_TMR2_1->ICONR_b.OVENA)
    {
        if ((1UL == bM4_TMR2_1->STFLR_b.OVFA) && (0UL != (VSSEL131 & BIT_MASK_06)))
        {
            TMR2_1_OvfA_IrqHandler();
        }
    }
    /* Timer2 unit1, Ch.B overflow */
    if (1UL == bM4_TMR2_1->ICONR_b.OVENB)
    {
        if ((1UL == bM4_TMR2_1->STFLR_b.OVFB) && (0UL != (VSSEL131 & BIT_MASK_07)))
        {
            TMR2_1_OvfB_IrqHandler();
        }
    }
    /* Timer2 unit2, Ch.A compare match */
    if (1UL == bM4_TMR2_2->ICONR_b.CMENA)
    {
        if ((1UL == bM4_TMR2_2->STFLR_b.CMFA) && (0UL != (VSSEL131 & BIT_MASK_08)))
        {
            TMR2_2_CmpA_IrqHandler();
        }
    }
    /* Timer2 unit2, Ch.B compare match */
    if (1UL == bM4_TMR2_2->ICONR_b.CMENB)
    {
        if ((1UL == bM4_TMR2_2->STFLR_b.CMFB) && (0UL != (VSSEL131 & BIT_MASK_09)))
        {
            TMR2_2_CmpB_IrqHandler();
        }
    }
    /* Timer2 unit2, Ch.A overflow */
    if (1UL == bM4_TMR2_2->ICONR_b.OVENA)
    {
        if ((1UL == bM4_TMR2_2->STFLR_b.OVFA) && (0UL != (VSSEL131 & BIT_MASK_10)))
        {
            TMR2_2_OvfA_IrqHandler();
        }
    }
    /* Timer2 unit2, Ch.B overflow */
    if (1UL == bM4_TMR2_2->ICONR_b.OVENB)
    {
        if ((1UL == bM4_TMR2_2->STFLR_b.OVFB) && (0UL != (VSSEL131 & BIT_MASK_11)))
        {
            TMR2_2_OvfB_IrqHandler();
        }
    }
        /* Timer2 unit3, Ch.A compare match */
    if (1UL == bM4_TMR2_3->ICONR_b.CMENA)
    {
        if ((1UL == bM4_TMR2_3->STFLR_b.CMFA) && (0UL != (VSSEL131 & BIT_MASK_12)))
        {
            TMR2_3_CmpA_IrqHandler();
        }
    }
    /* Timer2 unit3, Ch.B compare match */
    if (1UL == bM4_TMR2_3->ICONR_b.CMENB)
    {
        if ((1UL == bM4_TMR2_3->STFLR_b.CMFB) && (0UL != (VSSEL131 & BIT_MASK_13)))
        {
            TMR2_3_CmpB_IrqHandler();
        }
    }
    /* Timer2 unit3, Ch.A overflow */
    if (1UL == bM4_TMR2_3->ICONR_b.OVENA)
    {
        if ((1UL == bM4_TMR2_3->STFLR_b.OVFA) && (0UL != (VSSEL131 & BIT_MASK_14)))
        {
            TMR2_3_OvfA_IrqHandler();
        }
    }
    /* Timer2 unit3, Ch.B overflow */
    if (1UL == bM4_TMR2_3->ICONR_b.OVENB)
    {
        if ((1UL == bM4_TMR2_3->STFLR_b.OVFB) && (0UL != (VSSEL131 & BIT_MASK_15)))
        {
            TMR2_3_OvfB_IrqHandler();
        }
    }
        /* Timer2 unit4, Ch.A compare match */
    if (1UL == bM4_TMR2_4->ICONR_b.CMENA)
    {
        if ((1UL == bM4_TMR2_4->STFLR_b.CMFA) && (0UL != (VSSEL131 & BIT_MASK_16)))
        {
            TMR2_4_CmpA_IrqHandler();
        }
    }
    /* Timer2 unit4, Ch.B compare match */
    if (1UL == bM4_TMR2_4->ICONR_b.CMENB)
    {
        if ((1UL == bM4_TMR2_4->STFLR_b.CMFB) && (0UL != (VSSEL131 & BIT_MASK_17)))
        {
            TMR2_4_CmpB_IrqHandler();
        }
    }
    /* Timer2 unit4, Ch.A overflow */
    if (1UL == bM4_TMR2_4->ICONR_b.OVENA)
    {
        if ((1UL == bM4_TMR2_4->STFLR_b.OVFA) && (0UL != (VSSEL131 & BIT_MASK_18)))
        {
            TMR2_4_OvfA_IrqHandler();
        }
    }
    /* Timer2 unit4, Ch.B overflow */
    if (1UL == bM4_TMR2_4->ICONR_b.OVENB)
    {
        if ((1UL == bM4_TMR2_4->STFLR_b.OVFB) && (0UL != (VSSEL131 & BIT_MASK_19)))
        {
            TMR2_4_OvfB_IrqHandler();
        }
    }
    /* RTC time stamp 0 */
    if (1UL == bM4_RTC->TPCR0_b.TPIE0)
    {
        if ((1UL == bM4_RTC->TPSR_b.TPF0) && (0UL != (VSSEL131 & BIT_MASK_24)))
        {
            RTC_TimeStamp0_IrqHandler();
        }
    }
    /* RTC time stamp 1 */
    if (1UL == bM4_RTC->TPCR1_b.TPIE1)
    {
        if ((1UL == bM4_RTC->TPSR_b.TPF1) && (0UL != (VSSEL131 & BIT_MASK_24)))
        {
            RTC_TimeStamp1_IrqHandler();
        }
    }
    /* RTC alarm */
    if (1UL == bM4_RTC->CR2_b.ALMIE)
    {
        if ((1UL == bM4_RTC->CR2_b.ALMF) && (0UL != (VSSEL131 & BIT_MASK_25)))
        {
            RTC_Alarm_IrqHandler();
        }
    }
    /* RTC period */
    if (1UL == bM4_RTC->CR2_b.PRDIE)
    {
        if ((1UL == bM4_RTC->CR2_b.PRDF) && (0UL != (VSSEL131 & BIT_MASK_26)))
        {
            RTC_Period_IrqHandler();
        }
    }
    /* XTAL stop */
    if (1UL == bM4_CMU->XTALSTDCR_b.XTALSTDIE)
    {
        if ((1UL == bM4_CMU->XTALSTDSR_b.XTALSTDF) && (0UL != (VSSEL131 & BIT_MASK_29)))
        {
            CLK_XtalStop_IrqHandler();
        }
    }
    /* Wakeup timer overflow */
    if (1UL == bM4_PWC->WKTC2_b.WKTCE)
    {
        if ((1UL == bM4_PWC->WKTC2_b.WKOVF) && (0UL != (VSSEL131 & BIT_MASK_30)))
        {
            PWC_WakeupTimer_IrqHandler();
        }
    }
    /* SWDT underflow or refresh error */
    u32Tmp1 = M4_SWDT->SR & (SWDT_SR_UDF | SWDT_SR_REF);
    if ((0UL != u32Tmp1) && (0UL != (VSSEL131 & BIT_MASK_31)))
    {
        SWDT_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.132 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ132_Handler(void)
{
    const uint32_t VSSEL132 = M4_INTC->VSSEL132;

