RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
    /* Timer6 Ch.1 general compare match A */
    if (1UL == bM4_TMR6_1->ICONR_b.INTENA)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMAF) && (0UL != (VSSEL132 & BIT_MASK_00)))
        {
            TMR6_1_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.1 general compare match B */
    if (1UL == bM4_TMR6_1->ICONR_b.INTENB)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMBF) && (0UL != (VSSEL132 & BIT_MASK_01)))
        {
            TMR6_1_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.1 general compare match C */
    if (1UL == bM4_TMR6_1->ICONR_b.INTENC)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMCF) && (0UL != (VSSEL132 & BIT_MASK_02)))
        {
            TMR6_1_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.1 general compare match D */
    if (1UL == bM4_TMR6_1->ICONR_b.INTEND)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMDF) && (0UL != (VSSEL132 & BIT_MASK_03)))
        {
            TMR6_1_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.1 general compare match E */
    if (1UL == bM4_TMR6_1->ICONR_b.INTENE)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMEF) && (0UL != (VSSEL132 & BIT_MASK_04)))
        {
            TMR6_1_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.1 general compare match F */
    if (1UL == bM4_TMR6_1->ICONR_b.INTENF)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMFF) && (0UL != (VSSEL132 & BIT_MASK_05)))
        {
            TMR6_1_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.1 overflow*/
    if (1UL == bM4_TMR6_1->ICONR_b.INTENOVF)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.OVFF) && (0UL != (VSSEL132 & BIT_MASK_06)))
        {
            TMR6_1_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.1 underflow*/
    if (1UL == bM4_TMR6_1->ICONR_b.INTENUDF)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.UDFF) && (0UL != (VSSEL132 & BIT_MASK_07)))
        {
            TMR6_1_GUdf_IrqHandler();
        }
    }
    /* Timer4 Ch.1 U phase higher compare match */
    if (1UL == bM4_TMR4_1->OCSRU_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_1->OCSRU_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_08)))
        {
            TMR4_1_GCmpUH_IrqHandler();
        }
    }
    /* Timer4 Ch.1 U phase lower compare match */
    if (1UL == bM4_TMR4_1->OCSRU_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_1->OCSRU_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_09)))
        {
            TMR4_1_GCmpUL_IrqHandler();
        }
    }
    /* Timer4 Ch.1 V phase higher compare match */
    if (1UL == bM4_TMR4_1->OCSRV_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_1->OCSRV_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_10)))
        {
            TMR4_1_GCmpVH_IrqHandler();
        }
    }
    /* Timer4 Ch.1 V phase lower compare match */
    if (1UL == bM4_TMR4_1->OCSRV_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_1->OCSRV_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_11)))
        {
            TMR4_1_GCmpVL_IrqHandler();
        }
    }
    /* Timer4 Ch.1 W phase higher compare match */
    if (1UL == bM4_TMR4_1->OCSRW_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_1->OCSRW_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_12)))
        {
            TMR4_1_GCmpWH_IrqHandler();
        }
    }
    /* Timer4 Ch.1 W phase lower compare match */
    if (1UL == bM4_TMR4_1->OCSRW_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_1->OCSRW_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_13)))
        {
            TMR4_1_GCmpWL_IrqHandler();
        }
    }
    /* Timer4 Ch.1 overflow */
    if (1UL == bM4_TMR4_1->CCSR_b.IRQPEN)
    {
        if ((1UL == bM4_TMR4_1->CCSR_b.IRQPF) && (0UL != (VSSEL132 & BIT_MASK_14)))
        {
            TMR4_1_Ovf_IrqHandler();
        }
    }
    /* Timer4 Ch.1 underflow */
    if (1UL == bM4_TMR4_1->CCSR_b.IRQZEN)
    {
        if ((1UL == bM4_TMR4_1->CCSR_b.IRQZF) && (0UL != (VSSEL132 & BIT_MASK_15)))
        {
            TMR4_1_Udf_IrqHandler();
        }
    }
    /* Timer6 Ch.2 general compare match A */
    if (1UL == bM4_TMR6_2->ICONR_b.INTENA)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMAF) && (0UL != (VSSEL132 & BIT_MASK_16)))
        {
            TMR6_2_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.2 general compare match B */
    if (1UL == bM4_TMR6_2->ICONR_b.INTENB)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMBF) && (0UL != (VSSEL132 & BIT_MASK_17)))
        {
            TMR6_2_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.2 general compare match C */
    if (1UL == bM4_TMR6_2->ICONR_b.INTENC)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMCF) && (0UL != (VSSEL132 & BIT_MASK_18)))
        {
            TMR6_2_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.2 general compare match D */
    if (1UL == bM4_TMR6_2->ICONR_b.INTEND)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMDF) && (0UL != (VSSEL132 & BIT_MASK_19)))
        {
            TMR6_2_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.2 general compare match E */
    if (1UL == bM4_TMR6_2->ICONR_b.INTENE)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMEF) && (0UL != (VSSEL132 & BIT_MASK_20)))
        {
            TMR6_2_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.2 general compare match F */
    if (1UL == bM4_TMR6_2->ICONR_b.INTENF)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMFF) && (0UL != (VSSEL132 & BIT_MASK_21)))
        {
            TMR6_2_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.2 overflow*/
    if (1UL == bM4_TMR6_2->ICONR_b.INTENOVF)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.OVFF) && (0UL != (VSSEL132 & BIT_MASK_22)))
        {
            TMR6_2_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.2 underflow*/
    if (1UL == bM4_TMR6_2->ICONR_b.INTENUDF)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.UDFF) && (0UL != (VSSEL132 & BIT_MASK_23)))
        {
            TMR6_2_GUdf_IrqHandler();
        }
    }
    /* Timer4 Ch.2 U phase higher compare match */
    if (1UL == bM4_TMR4_2->OCSRU_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_2->OCSRU_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_24)))
        {
            TMR4_2_GCmpUH_IrqHandler();
        }
    }
    /* Timer4 Ch.2 U phase lower compare match */
    if (1UL == bM4_TMR4_2->OCSRU_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_2->OCSRU_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_25)))
        {
            TMR4_2_GCmpUL_IrqHandler();
        }
    }
    /* Timer4 Ch.2 V phase higher compare match */
    if (1UL == bM4_TMR4_2->OCSRV_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_2->OCSRV_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_26)))
        {
            TMR4_2_GCmpVH_IrqHandler();
        }
    }
    /* Timer4 Ch.2 V phase lower compare match */
    if (1UL == bM4_TMR4_2->OCSRV_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_2->OCSRV_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_27)))
        {
            TMR4_2_GCmpVL_IrqHandler();
        }
    }
    /* Timer4 Ch.2 W phase higher compare match */
    if (1UL == bM4_TMR4_2->OCSRW_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_2->OCSRW_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_28)))
        {
            TMR4_2_GCmpWH_IrqHandler();
        }
    }
    /* Timer4 Ch.2 W phase lower compare match */
    if (1UL == bM4_TMR4_2->OCSRW_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_2->OCSRW_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_29)))
        {
            TMR4_2_GCmpWL_IrqHandler();
        }
    }
    /* Timer4 Ch.2 overflow */
    if (1UL == bM4_TMR4_2->CCSR_b.IRQPEN)
    {
        if ((1UL == bM4_TMR4_2->CCSR_b.IRQPF) && (0UL != (VSSEL132 & BIT_MASK_30)))
        {
            TMR4_2_Ovf_IrqHandler();
        }
    }
    /* Timer4 Ch.2 underflow */
    if (1UL == bM4_TMR4_2->CCSR_b.IRQZEN)
    {
        if ((1UL == bM4_TMR4_2->CCSR_b.IRQZF) && (0UL != (VSSEL132 & BIT_MASK_31)))
        {
            TMR4_2_Udf_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.133 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ133_Handler(void)
{
    const uint32_t VSSEL133 = M4_INTC->VSSEL133;

    /* Timer6 Ch.3 general compare match A */
    if (1UL == bM4_TMR6_3->ICONR_b.INTENA)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMAF) && (0UL != (VSSEL133 & BIT_MASK_00)))
        {
            TMR6_3_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.3 general compare match B */
    if (1UL == bM4_TMR6_3->ICONR_b.INTENB)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMBF) && (0UL != (VSSEL133 & BIT_MASK_01)))
        {
            TMR6_3_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.3 general compare match C */
    if (1UL == bM4_TMR6_3->ICONR_b.INTENC)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMCF) && (0UL != (VSSEL133 & BIT_MASK_02)))
        {
            TMR6_3_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.3 general compare match D */
    if (1UL == bM4_TMR6_3->ICONR_b.INTEND)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMDF) && (0UL != (VSSEL133 & BIT_MASK_03)))
        {
            TMR6_3_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.3 general compare match E */
    if (1UL == bM4_TMR6_3->ICONR_b.INTENE)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMEF) && (0UL != (VSSEL133 & BIT_MASK_04)))
        {
            TMR6_3_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.3 general compare match F */
    if (1UL == bM4_TMR6_3->ICONR_b.INTENF)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMFF) && (0UL != (VSSEL133 & BIT_MASK_05)))
        {
            TMR6_3_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.3 overflow*/
    if (1UL == bM4_TMR6_3->ICONR_b.INTENOVF)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.OVFF) && (0UL != (VSSEL133 & BIT_MASK_06)))
        {
            TMR6_3_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.3 underflow*/
    if (1UL == bM4_TMR6_3->ICONR_b.INTENUDF)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.UDFF) && (0UL != (VSSEL133 & BIT_MASK_07)))
        {
            TMR6_3_GUdf_IrqHandler();
        }
    }
    /* Timer4 Ch.3 U phase higher compare match */
    if (1UL == bM4_TMR4_3->OCSRU_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_3->OCSRU_b.OCFH) && (0UL != (VSSEL133 & BIT_MASK_08)))
        {
            TMR4_3_GCmpUH_IrqHandler();
        }
    }
    /* Timer4 Ch.3 U phase lower compare match */
    if (1UL == bM4_TMR4_3->OCSRU_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_3->OCSRU_b.OCFL) && (0UL != (VSSEL133 & BIT_MASK_09)))
        {
            TMR4_3_GCmpUL_IrqHandler();
        }
    }
    /* Timer4 Ch.3 V phase higher compare match */
    if (1UL == bM4_TMR4_3->OCSRV_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_3->OCSRV_b.OCFH) && (0UL != (VSSEL133 & BIT_MASK_10)))
        {
            TMR4_3_GCmpVH_IrqHandler();
        }
    }
    /* Timer4 Ch.3 V phase lower compare match */
    if (1UL == bM4_TMR4_3->OCSRV_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_3->OCSRV_b.OCFL) && (0UL != (VSSEL133 & BIT_MASK_11)))
        {
            TMR4_3_GCmpVL_IrqHandler();
        }
    }
    /* Timer4 Ch.3 W phase higher compare match */
    if (1UL == bM4_TMR4_3->OCSRW_b.OCIEH)
    {
        if ((1UL == bM4_TMR4_3->OCSRW_b.OCFH) && (0UL != (VSSEL133 & BIT_MASK_12)))
        {
            TMR4_3_GCmpWH_IrqHandler();
        }
    }
    /* Timer4 Ch.3 W phase lower compare match */
    if (1UL == bM4_TMR4_3->OCSRW_b.OCIEL)
    {
        if ((1UL == bM4_TMR4_3->OCSRW_b.OCFL) && (0UL != (VSSEL133 & BIT_MASK_13)))
        {
            TMR4_3_GCmpWL_IrqHandler();
        }
    }
    /* Timer4 Ch.3 overflow */
    if (1UL == bM4_TMR4_3->CCSR_b.IRQPEN)
    {
        if ((1UL == bM4_TMR4_3->CCSR_b.IRQPF) && (0UL != (VSSEL133 & BIT_MASK_14)))
        {
            TMR4_3_Ovf_IrqHandler();
        }
    }
    /* Timer4 Ch.3 underflow */
    if (1UL == bM4_TMR4_3->CCSR_b.IRQZEN)
    {
        if ((1UL == bM4_TMR4_3->CCSR_b.IRQZF) && (0UL != (VSSEL133 & BIT_MASK_15)))
        {
            TMR4_3_Udf_IrqHandler();
        }
    }
    /* Timer6 Ch.1 dead time */
    if (1UL == bM4_TMR6_1->ICONR_b.INTENDTE)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.DTEF) && (0UL != (VSSEL133 & BIT_MASK_16)))
        {
            TMR6_1_Gdte_IrqHandler();
        }
    }
    /* Timer6 Ch.1 specified up compare match A*/
    if (1UL == bM4_TMR6_1->ICONR_b.INTENSAU)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMSAUF) && (0UL != (VSSEL133 & BIT_MASK_19)))
        {
            TMR6_1_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Ch.1 specified down compare match A*/
    if (1UL == bM4_TMR6_1->ICONR_b.INTENSAD)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMSADF) && (0UL != (VSSEL133 & BIT_MASK_19)))
        {
            TMR6_1_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Ch.1 specified up compare match B*/
    if (1UL == bM4_TMR6_1->ICONR_b.INTENSBU)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMSBUF) && (0UL != (VSSEL133 & BIT_MASK_20)))
        {
            TMR6_1_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Ch.1 specified down compare match B*/
    if (1UL == bM4_TMR6_1->ICONR_b.INTENSBD)
    {
        if ((1UL == bM4_TMR6_1->STFLR_b.CMSBDF) && (0UL != (VSSEL133 & BIT_MASK_20)))
        {
            TMR6_1_SCmpDownB_IrqHandler();
        }
    }
    /* Timer4 Ch.1 U phase reload */
    if (0UL == bM4_TMR4_1->RCSR_b.RTIDU)
    {
        if ((1UL == bM4_TMR4_1->RCSR_b.RTIFU) && (0UL != (VSSEL133 & BIT_MASK_21)))
        {
            TMR4_1_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Ch.1 V phase reload */
    if (0UL == bM4_TMR4_1->RCSR_b.RTIDV)
    {
        if ((1UL == bM4_TMR4_1->RCSR_b.RTIFV) && (0UL != (VSSEL133 & BIT_MASK_22)))
        {
            TMR4_1_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Ch.1 W phase reload */
    if (0UL == bM4_TMR4_1->RCSR_b.RTIDW)
    {
        if ((1UL == bM4_TMR4_1->RCSR_b.RTIFW) && (0UL != (VSSEL133 & BIT_MASK_23)))
        {
            TMR4_1_ReloadU_IrqHandler();
        }
    }
    /* Timer6 Ch.2 dead time */
    if (1UL == bM4_TMR6_2->ICONR_b.INTENDTE)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.DTEF) && (0UL != (VSSEL133 & BIT_MASK_24)))
        {
            TMR6_2_Gdte_IrqHandler();
        }
    }
    /* Timer6 Ch.2 specified up compare match A*/
    if (1UL == bM4_TMR6_2->ICONR_b.INTENSAU)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMSAUF) && (0UL != (VSSEL133 & BIT_MASK_27)))
        {
            TMR6_2_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Ch.2 specified down compare match A*/
    if (1UL == bM4_TMR6_2->ICONR_b.INTENSAD)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMSADF) && (0UL != (VSSEL133 & BIT_MASK_27)))
        {
            TMR6_2_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Ch.2 specified up compare match B*/
    if (1UL == bM4_TMR6_2->ICONR_b.INTENSBU)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMSBUF) && (0UL != (VSSEL133 & BIT_MASK_28)))
        {
            TMR6_2_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Ch.2 specified down compare match B*/
    if (1UL == bM4_TMR6_2->ICONR_b.INTENSBD)
    {
        if ((1UL == bM4_TMR6_2->STFLR_b.CMSBDF) && (0UL != (VSSEL133 & BIT_MASK_28)))
        {
            TMR6_2_SCmpDownB_IrqHandler();
        }
    }
    /* Timer4 Ch.2 U phase reload */
    if (0UL == bM4_TMR4_2->RCSR_b.RTIDU)
    {
        if ((1UL == bM4_TMR4_2->RCSR_b.RTIFU) && (0UL != (VSSEL133 & BIT_MASK_29)))
        {
            TMR4_2_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Ch.2 V phase reload */
    if (0UL == bM4_TMR4_2->RCSR_b.RTIDV)
    {
        if ((1UL == bM4_TMR4_2->RCSR_b.RTIFV) && (0UL != (VSSEL133 & BIT_MASK_30)))
        {
            TMR4_2_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Ch.2 W phase reload */
    if (0UL == bM4_TMR4_2->RCSR_b.RTIDW)
    {
        if ((1UL == bM4_TMR4_2->RCSR_b.RTIFW) && (0UL != (VSSEL133 & BIT_MASK_31)))
        {
            TMR4_2_ReloadU_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.134 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ134_Handler(void)
{
    const uint32_t VSSEL134 = M4_INTC->VSSEL134;

    /* Timer6 Ch.3 dead time */
    if (1UL == bM4_TMR6_3->ICONR_b.INTENDTE)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.DTEF) && (0UL != (VSSEL134 & BIT_MASK_00)))
        {
            TMR6_3_Gdte_IrqHandler();
        }
    }
    /* Timer6 Ch.3 specified up compare match A*/
    if (1UL == bM4_TMR6_3->ICONR_b.INTENSAU)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMSAUF) && (0UL != (VSSEL134 & BIT_MASK_03)))
        {
            TMR6_3_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Ch.3 specified down compare match A*/
    if (1UL == bM4_TMR6_3->ICONR_b.INTENSAD)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMSADF) && (0UL != (VSSEL134 & BIT_MASK_03)))
        {
            TMR6_3_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Ch.3 specified up compare match B*/
    if (1UL == bM4_TMR6_3->ICONR_b.INTENSBU)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMSBUF) && (0UL != (VSSEL134 & BIT_MASK_04)))
        {
            TMR6_3_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Ch.3 specified down compare match B*/
    if (1UL == bM4_TMR6_3->ICONR_b.INTENSBD)
    {
        if ((1UL == bM4_TMR6_3->STFLR_b.CMSBDF) && (0UL != (VSSEL134 & BIT_MASK_04)))
        {
            TMR6_3_SCmpDownB_IrqHandler();
        }
    }
    /* Timer4 Ch.3 U phase reload */
    if (0UL == bM4_TMR4_3->RCSR_b.RTIDU)
    {
        if ((1UL == bM4_TMR4_3->RCSR_b.RTIFU) && (0UL != (VSSEL134 & BIT_MASK_05)))
        {
            TMR4_3_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Ch.3 V phase reload */
    if (0UL == bM4_TMR4_3->RCSR_b.RTIDV)
    {
        if ((1UL == bM4_TMR4_3->RCSR_b.RTIFV) && (0UL != (VSSEL134 & BIT_MASK_06)))
        {
            TMR4_3_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Ch.3 W phase reload */
    if (0UL == bM4_TMR4_3->RCSR_b.RTIDW)
    {
        if ((1UL == bM4_TMR4_3->RCSR_b.RTIFW) && (0UL != (VSSEL134 & BIT_MASK_07)))
        {
            TMR4_3_ReloadU_IrqHandler();
        }
    }
    /* Timer6 Ch.4 general compare match A */
    if (1UL == bM4_TMR6_4->ICONR_b.INTENA)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMAF) && (0UL != (VSSEL134 & BIT_MASK_16)))
        {
            TMR6_4_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.4 general compare match B */
    if (1UL == bM4_TMR6_4->ICONR_b.INTENB)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMBF) && (0UL != (VSSEL134 & BIT_MASK_17)))
        {
            TMR6_4_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.4 general compare match C */
    if (1UL == bM4_TMR6_4->ICONR_b.INTENC)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMCF) && (0UL != (VSSEL134 & BIT_MASK_18)))
        {
            TMR6_4_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.4 general compare match D */
    if (1UL == bM4_TMR6_4->ICONR_b.INTEND)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMDF) && (0UL != (VSSEL134 & BIT_MASK_19)))
        {
            TMR6_4_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.4 general compare match E */
    if (1UL == bM4_TMR6_4->ICONR_b.INTENE)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMEF) && (0UL != (VSSEL134 & BIT_MASK_20)))
        {
            TMR6_4_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.4 general compare match F */
    if (1UL == bM4_TMR6_4->ICONR_b.INTENF)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMFF) && (0UL != (VSSEL134 & BIT_MASK_21)))
        {
            TMR6_4_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.4 overflow*/
    if (1UL == bM4_TMR6_4->ICONR_b.INTENOVF)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.OVFF) && (0UL != (VSSEL134 & BIT_MASK_22)))
        {
            TMR6_4_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.4 underflow*/
    if (1UL == bM4_TMR6_4->ICONR_b.INTENUDF)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.UDFF) && (0UL != (VSSEL134 & BIT_MASK_23)))
        {
            TMR6_4_GUdf_IrqHandler();
        }
    }
    /* Timer6 Ch.4 dead time */
    if (1UL == bM4_TMR6_4->ICONR_b.INTENDTE)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.DTEF) && (0UL != (VSSEL134 & BIT_MASK_24)))
        {
            TMR6_4_Gdte_IrqHandler();
        }
    }
    /* Timer6 Ch.4 specified up compare match A*/
    if (1UL == bM4_TMR6_4->ICONR_b.INTENSAU)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMSAUF) && (0UL != (VSSEL134 & BIT_MASK_27)))
        {
            TMR6_4_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Ch.4 specified down compare match A*/
    if (1UL == bM4_TMR6_4->ICONR_b.INTENSAD)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMSADF) && (0UL != (VSSEL134 & BIT_MASK_27)))
        {
            TMR6_4_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Ch.4 specified up compare match B*/
    if (1UL == bM4_TMR6_4->ICONR_b.INTENSBU)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMSBUF) && (0UL != (VSSEL134 & BIT_MASK_28)))
        {
            TMR6_4_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Ch.4 specified down compare match B*/
    if (1UL == bM4_TMR6_4->ICONR_b.INTENSBD)
    {
        if ((1UL == bM4_TMR6_4->STFLR_b.CMSBDF) && (0UL != (VSSEL134 & BIT_MASK_28)))
        {
            TMR6_4_SCmpDownB_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.135 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ135_Handler(void)
{
    const uint32_t VSSEL135 = M4_INTC->VSSEL135;

