RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
    /* Timer6 Ch.5 general compare match A */
    if (1UL == bM4_TMR6_5->ICONR_b.INTENA)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMAF) && (0UL != (VSSEL135 & BIT_MASK_00)))
        {
            TMR6_5_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.5 general compare match B */
    if (1UL == bM4_TMR6_5->ICONR_b.INTENB)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMBF) && (0UL != (VSSEL135 & BIT_MASK_01)))
        {
            TMR6_5_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.5 general compare match C */
    if (1UL == bM4_TMR6_5->ICONR_b.INTENC)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMCF) && (0UL != (VSSEL135 & BIT_MASK_02)))
        {
            TMR6_5_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.5 general compare match D */
    if (1UL == bM4_TMR6_5->ICONR_b.INTEND)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMDF) && (0UL != (VSSEL135 & BIT_MASK_03)))
        {
            TMR6_5_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.5 general compare match E */
    if (1UL == bM4_TMR6_5->ICONR_b.INTENE)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMEF) && (0UL != (VSSEL135 & BIT_MASK_04)))
        {
            TMR6_5_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.5 general compare match F */
    if (1UL == bM4_TMR6_5->ICONR_b.INTENF)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMFF) && (0UL != (VSSEL135 & BIT_MASK_05)))
        {
            TMR6_5_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.5 overflow*/
    if (1UL == bM4_TMR6_5->ICONR_b.INTENOVF)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.OVFF) && (0UL != (VSSEL135 & BIT_MASK_06)))
        {
            TMR6_5_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.5 underflow*/
    if (1UL == bM4_TMR6_5->ICONR_b.INTENUDF)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.UDFF) && (0UL != (VSSEL135 & BIT_MASK_07)))
        {
            TMR6_5_GUdf_IrqHandler();
        }
    }
    /* Timer6 Ch.5 dead time */
    if (1UL == bM4_TMR6_5->ICONR_b.INTENDTE)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.DTEF) && (0UL != (VSSEL135 & BIT_MASK_08)))
        {
            TMR6_5_Gdte_IrqHandler();
        }
    }
    /* Timer6 Ch.5 specified up compare match A*/
    if (1UL == bM4_TMR6_5->ICONR_b.INTENSAU)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMSAUF) && (0UL != (VSSEL135 & BIT_MASK_11)))
        {
            TMR6_5_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Ch.5 specified down compare match A*/
    if (1UL == bM4_TMR6_5->ICONR_b.INTENSAD)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMSADF) && (0UL != (VSSEL135 & BIT_MASK_11)))
        {
            TMR6_5_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Ch.5 specified up compare match B*/
    if (1UL == bM4_TMR6_5->ICONR_b.INTENSBU)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMSBUF) && (0UL != (VSSEL135 & BIT_MASK_12)))
        {
            TMR6_5_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Ch.5 specified down compare match B*/
    if (1UL == bM4_TMR6_5->ICONR_b.INTENSBD)
    {
        if ((1UL == bM4_TMR6_5->STFLR_b.CMSBDF) && (0UL != (VSSEL135 & BIT_MASK_12)))
        {
            TMR6_5_SCmpDownB_IrqHandler();
        }
    }
    /* TimerA Ch.1 overflow */
    if (1UL == bM4_TMRA_1->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_1->BCSTR_b.OVFF) && (0UL != (VSSEL135 & BIT_MASK_13)))
        {
            TMRA_1_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.1 underflow */
    if (1UL == bM4_TMRA_1->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_1->BCSTR_b.UDFF) && (0UL != (VSSEL135 & BIT_MASK_14)))
        {
            TMRA_1_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.1 compare match 1 */
    if (1UL == bM4_TMRA_1->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_1->STFLR_b.CMPF1) && (0UL != (VSSEL135 & BIT_MASK_15)))
        {
            TMRA_1_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.1 compare match 2 */
    if (1UL == bM4_TMRA_1->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_1->STFLR_b.CMPF2) && (0UL != (VSSEL135 & BIT_MASK_15)))
        {
            TMRA_1_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.1 compare match 3 */
    if (1UL == bM4_TMRA_1->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_1->STFLR_b.CMPF3) && (0UL != (VSSEL135 & BIT_MASK_15)))
        {
            TMRA_1_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.1 compare match 4 */
    if (1UL == bM4_TMRA_1->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_1->STFLR_b.CMPF4) && (0UL != (VSSEL135 & BIT_MASK_15)))
        {
            TMRA_1_Cmp4_IrqHandler();
        }
    }
    /* Timer6 Ch.6 general compare match A */
    if (1UL == bM4_TMR6_6->ICONR_b.INTENA)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMAF) && (0UL != (VSSEL135 & BIT_MASK_16)))
        {
            TMR6_6_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.6 general compare match B */
    if (1UL == bM4_TMR6_6->ICONR_b.INTENB)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMBF) && (0UL != (VSSEL135 & BIT_MASK_17)))
        {
            TMR6_6_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.6 general compare match C */
    if (1UL == bM4_TMR6_6->ICONR_b.INTENC)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMCF) && (0UL != (VSSEL135 & BIT_MASK_18)))
        {
            TMR6_6_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.6 general compare match D */
    if (1UL == bM4_TMR6_6->ICONR_b.INTEND)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMDF) && (0UL != (VSSEL135 & BIT_MASK_19)))
        {
            TMR6_6_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.6 general compare match E */
    if (1UL == bM4_TMR6_6->ICONR_b.INTENE)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMEF) && (0UL != (VSSEL135 & BIT_MASK_20)))
        {
            TMR6_6_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.6 general compare match F */
    if (1UL == bM4_TMR6_6->ICONR_b.INTENF)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMFF) && (0UL != (VSSEL135 & BIT_MASK_21)))
        {
            TMR6_6_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.6 overflow*/
    if (1UL == bM4_TMR6_6->ICONR_b.INTENOVF)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.OVFF) && (0UL != (VSSEL135 & BIT_MASK_22)))
        {
            TMR6_6_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.6 underflow*/
    if (1UL == bM4_TMR6_6->ICONR_b.INTENUDF)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.UDFF) && (0UL != (VSSEL135 & BIT_MASK_23)))
        {
            TMR6_6_GUdf_IrqHandler();
        }
    }
    /* Timer6 Ch.6 dead time */
    if (1UL == bM4_TMR6_6->ICONR_b.INTENDTE)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.DTEF) && (0UL != (VSSEL135 & BIT_MASK_24)))
        {
            TMR6_6_Gdte_IrqHandler();
        }
    }
    /* Timer6 Ch.6 specified up compare match A*/
    if (1UL == bM4_TMR6_6->ICONR_b.INTENSAU)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMSAUF) && (0UL != (VSSEL135 & BIT_MASK_27)))
        {
            TMR6_6_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Ch.6 specified down compare match A*/
    if (1UL == bM4_TMR6_6->ICONR_b.INTENSAD)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMSADF) && (0UL != (VSSEL135 & BIT_MASK_27)))
        {
            TMR6_6_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Ch.6 specified up compare match B*/
    if (1UL == bM4_TMR6_6->ICONR_b.INTENSBU)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMSBUF) && (0UL != (VSSEL135 & BIT_MASK_28)))
        {
            TMR6_6_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Ch.6 specified down compare match B*/
    if (1UL == bM4_TMR6_6->ICONR_b.INTENSBD)
    {
        if ((1UL == bM4_TMR6_6->STFLR_b.CMSBDF) && (0UL != (VSSEL135 & BIT_MASK_28)))
        {
            TMR6_6_SCmpDownB_IrqHandler();
        }
    }
    /* TimerA Ch.2 overflow */
    if (1UL == bM4_TMRA_2->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_2->BCSTR_b.OVFF) && (0UL != (VSSEL135 & BIT_MASK_29)))
        {
            TMRA_2_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.2 underflow */
    if (1UL == bM4_TMRA_2->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_2->BCSTR_b.UDFF) && (0UL != (VSSEL135 & BIT_MASK_30)))
        {
            TMRA_2_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.2 compare match 1 */
    if (1UL == bM4_TMRA_2->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_2->STFLR_b.CMPF1) && (0UL != (VSSEL135 & BIT_MASK_31)))
        {
            TMRA_2_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.2 compare match 2 */
    if (1UL == bM4_TMRA_2->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_2->STFLR_b.CMPF2) && (0UL != (VSSEL135 & BIT_MASK_31)))
        {
            TMRA_2_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.2 compare match 3 */
    if (1UL == bM4_TMRA_2->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_2->STFLR_b.CMPF3) && (0UL != (VSSEL135 & BIT_MASK_31)))
        {
            TMRA_2_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.2 compare match 4 */
    if (1UL == bM4_TMRA_2->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_2->STFLR_b.CMPF4) && (0UL != (VSSEL135 & BIT_MASK_31)))
        {
            TMRA_2_Cmp4_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.136 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ136_Handler(void)
{
    const uint32_t VSSEL136 = M4_INTC->VSSEL136;

    /* Timer6 Ch.7 general compare match A */
    if (1UL == bM4_TMR6_7->ICONR_b.INTENA)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMAF) && (0UL != (VSSEL136 & BIT_MASK_00)))
        {
            TMR6_7_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.7 general compare match B */
    if (1UL == bM4_TMR6_7->ICONR_b.INTENB)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMBF) && (0UL != (VSSEL136 & BIT_MASK_01)))
        {
            TMR6_7_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.7 general compare match C */
    if (1UL == bM4_TMR6_7->ICONR_b.INTENC)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMCF) && (0UL != (VSSEL136 & BIT_MASK_02)))
        {
            TMR6_7_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.7 general compare match D */
    if (1UL == bM4_TMR6_7->ICONR_b.INTEND)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMDF) && (0UL != (VSSEL136 & BIT_MASK_03)))
        {
            TMR6_7_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.7 general compare match E */
    if (1UL == bM4_TMR6_7->ICONR_b.INTENE)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMEF) && (0UL != (VSSEL136 & BIT_MASK_04)))
        {
            TMR6_7_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.7 general compare match F */
    if (1UL == bM4_TMR6_7->ICONR_b.INTENF)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMFF) && (0UL != (VSSEL136 & BIT_MASK_05)))
        {
            TMR6_7_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.7 overflow*/
    if (1UL == bM4_TMR6_7->ICONR_b.INTENOVF)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.OVFF) && (0UL != (VSSEL136 & BIT_MASK_06)))
        {
            TMR6_7_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.7 underflow*/
    if (1UL == bM4_TMR6_7->ICONR_b.INTENUDF)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.UDFF) && (0UL != (VSSEL136 & BIT_MASK_07)))
        {
            TMR6_7_GUdf_IrqHandler();
        }
    }
    /* Timer6 Ch.7 dead time */
    if (1UL == bM4_TMR6_7->ICONR_b.INTENDTE)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.DTEF) && (0UL != (VSSEL136 & BIT_MASK_08)))
        {
            TMR6_7_Gdte_IrqHandler();
        }
    }
    /* Timer6 Ch.7 specified up compare match A*/
    if (1UL == bM4_TMR6_7->ICONR_b.INTENSAU)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMSAUF) && (0UL != (VSSEL136 & BIT_MASK_11)))
        {
            TMR6_7_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Ch.7 specified down compare match A*/
    if (1UL == bM4_TMR6_7->ICONR_b.INTENSAD)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMSADF) && (0UL != (VSSEL136 & BIT_MASK_11)))
        {
            TMR6_7_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Ch.7 specified up compare match B*/
    if (1UL == bM4_TMR6_7->ICONR_b.INTENSBU)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMSBUF) && (0UL != (VSSEL136 & BIT_MASK_12)))
        {
            TMR6_7_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Ch.7 specified down compare match B*/
    if (1UL == bM4_TMR6_7->ICONR_b.INTENSBD)
    {
        if ((1UL == bM4_TMR6_7->STFLR_b.CMSBDF) && (0UL != (VSSEL136 & BIT_MASK_12)))
        {
            TMR6_7_SCmpDownB_IrqHandler();
        }
    }
    /* TimerA Ch.3 overflow */
    if (1UL == bM4_TMRA_3->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_3->BCSTR_b.OVFF) && (0UL != (VSSEL136 & BIT_MASK_13)))
        {
            TMRA_3_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.3 underflow */
    if (1UL == bM4_TMRA_3->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_3->BCSTR_b.UDFF) && (0UL != (VSSEL136 & BIT_MASK_14)))
        {
            TMRA_3_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.3 compare match 1 */
    if (1UL == bM4_TMRA_3->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_3->STFLR_b.CMPF1) && (0UL != (VSSEL136 & BIT_MASK_15)))
        {
            TMRA_3_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.3 compare match 2 */
    if (1UL == bM4_TMRA_3->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_3->STFLR_b.CMPF2) && (0UL != (VSSEL136 & BIT_MASK_15)))
        {
            TMRA_3_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.3 compare match 3 */
    if (1UL == bM4_TMRA_3->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_3->STFLR_b.CMPF3) && (0UL != (VSSEL136 & BIT_MASK_15)))
        {
            TMRA_3_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.3 compare match 4 */
    if (1UL == bM4_TMRA_3->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_3->STFLR_b.CMPF4) && (0UL != (VSSEL136 & BIT_MASK_15)))
        {
            TMRA_3_Cmp4_IrqHandler();
        }
    }
    /* Timer6 Ch.8 general compare match A */
    if (1UL == bM4_TMR6_8->ICONR_b.INTENA)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMAF) && (0UL != (VSSEL136 & BIT_MASK_16)))
        {
            TMR6_8_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Ch.8 general compare match B */
    if (1UL == bM4_TMR6_8->ICONR_b.INTENB)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMBF) && (0UL != (VSSEL136 & BIT_MASK_17)))
        {
            TMR6_8_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Ch.8 general compare match C */
    if (1UL == bM4_TMR6_8->ICONR_b.INTENC)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMCF) && (0UL != (VSSEL136 & BIT_MASK_18)))
        {
            TMR6_8_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Ch.8 general compare match D */
    if (1UL == bM4_TMR6_8->ICONR_b.INTEND)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMDF) && (0UL != (VSSEL136 & BIT_MASK_19)))
        {
            TMR6_8_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Ch.8 general compare match E */
    if (1UL == bM4_TMR6_8->ICONR_b.INTENE)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMEF) && (0UL != (VSSEL136 & BIT_MASK_20)))
        {
            TMR6_8_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Ch.8 general compare match F */
    if (1UL == bM4_TMR6_8->ICONR_b.INTENF)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMFF) && (0UL != (VSSEL136 & BIT_MASK_21)))
        {
            TMR6_8_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Ch.8 overflow*/
    if (1UL == bM4_TMR6_8->ICONR_b.INTENOVF)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.OVFF) && (0UL != (VSSEL136 & BIT_MASK_22)))
        {
            TMR6_8_GOvf_IrqHandler();
        }
    }
    /* Timer6 Ch.8 underflow*/
    if (1UL == bM4_TMR6_8->ICONR_b.INTENUDF)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.UDFF) && (0UL != (VSSEL136 & BIT_MASK_23)))
        {
            TMR6_8_GUdf_IrqHandler();
        }
    }
    /* Timer6 Ch.8 dead time */
    if (1UL == bM4_TMR6_8->ICONR_b.INTENDTE)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.DTEF) && (0UL != (VSSEL136 & BIT_MASK_24)))
        {
            TMR6_8_Gdte_IrqHandler();
        }
    }
    /* Timer6 Ch.8 specified up compare match A*/
    if (1UL == bM4_TMR6_8->ICONR_b.INTENSAU)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMSAUF) && (0UL != (VSSEL136 & BIT_MASK_27)))
        {
            TMR6_8_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Ch.8 specified down compare match A*/
    if (1UL == bM4_TMR6_8->ICONR_b.INTENSAD)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMSADF) && (0UL != (VSSEL136 & BIT_MASK_27)))
        {
            TMR6_8_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Ch.8 specified up compare match B*/
    if (1UL == bM4_TMR6_8->ICONR_b.INTENSBU)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMSBUF) && (0UL != (VSSEL136 & BIT_MASK_28)))
        {
            TMR6_8_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Ch.8 specified down compare match B*/
    if (1UL == bM4_TMR6_8->ICONR_b.INTENSBD)
    {
        if ((1UL == bM4_TMR6_8->STFLR_b.CMSBDF) && (0UL != (VSSEL136 & BIT_MASK_28)))
        {
            TMR6_8_SCmpDownB_IrqHandler();
        }
    }
    /* TimerA Ch.4 overflow */
    if (1UL == bM4_TMRA_4->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_4->BCSTR_b.OVFF) && (0UL != (VSSEL136 & BIT_MASK_29)))
        {
            TMRA_4_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.4 underflow */
    if (1UL == bM4_TMRA_4->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_4->BCSTR_b.UDFF) && (0UL != (VSSEL136 & BIT_MASK_30)))
        {
            TMRA_4_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.4 compare match 1 */
    if (1UL == bM4_TMRA_4->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_4->STFLR_b.CMPF1) && (0UL != (VSSEL136 & BIT_MASK_31)))
        {
            TMRA_4_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.4 compare match 2 */
    if (1UL == bM4_TMRA_4->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_4->STFLR_b.CMPF2) && (0UL != (VSSEL136 & BIT_MASK_31)))
        {
            TMRA_4_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.4 compare match 3 */
    if (1UL == bM4_TMRA_4->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_4->STFLR_b.CMPF3) && (0UL != (VSSEL136 & BIT_MASK_31)))
        {
            TMRA_4_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.4 compare match 4 */
    if (1UL == bM4_TMRA_4->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_4->STFLR_b.CMPF4) && (0UL != (VSSEL136 & BIT_MASK_31)))
        {
            TMRA_4_Cmp4_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.137 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ137_Handler(void)
{
    const uint32_t VSSEL137 = M4_INTC->VSSEL137;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

    /* EMB0 */
    u32Tmp1 = M4_EMB0->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = M4_EMB0->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_00)))
    {
        EMB_GR0_IrqHandler();
    }
    /* EMB1 */
    u32Tmp1 = M4_EMB1->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = M4_EMB1->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_01)))
    {
        EMB_GR1_IrqHandler();
    }
    /* EMB2 */
    u32Tmp1 = M4_EMB2->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = M4_EMB2->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_02)))
    {
        EMB_GR2_IrqHandler();
    }
    /* EMB3 */
    u32Tmp1 = M4_EMB3->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = M4_EMB3->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_03)))
    {
        EMB_GR3_IrqHandler();
    }
    /* EMB4 */
    u32Tmp1 = M4_EMB4->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = M4_EMB4->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_04)))
    {
        EMB_GR4_IrqHandler();
    }
    /* EMB5 */
    u32Tmp1 = M4_EMB5->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = M4_EMB5->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_05)))
    {
        EMB_GR5_IrqHandler();
    }
    /* EMB6 */
    u32Tmp1 = M4_EMB6->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = M4_EMB6->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_06)))
    {
        EMB_GR6_IrqHandler();
    }
    /* USB HS EP1 out */

