RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
    /* USB HS EP1 in */

    /* USB HS global */

    /* USB HS wakeup */

    if (1UL == bM4_USART1->CR1_b.RIE)
    {
        /* USART Ch.1 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART1->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_12)))
        {
            USART_1_RxErr_IrqHandler();
        }
        /* USART Ch.1 Rx end */
        if ((1UL == bM4_USART1->SR_b.RXNE) && (0UL != (VSSEL137 & BIT_MASK_13)))
        {
            USART_1_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.1 Tx buffer empty */
    if (1UL == bM4_USART1->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART1->SR_b.TXE) && (0UL != (VSSEL137 & BIT_MASK_14)))
        {
            USART_1_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.1 Tx end */
    if (1UL == bM4_USART1->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART1->SR_b.TC) && (0UL != (VSSEL137 & BIT_MASK_15)))
        {
            USART_1_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.1 Tx timeout */
    if (1UL == bM4_USART1->CR1_b.RTOIE)
    {
        if ((1UL == bM4_USART1->SR_b.RTOF) && (0UL != (VSSEL137 & BIT_MASK_16)))
        {
            USART_1_RxTO_IrqHandler();
        }
    }
    if (1UL == bM4_USART2->CR1_b.RIE)
    {
        /* USART Ch.2 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART2->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_17)))
        {
            USART_2_RxErr_IrqHandler();
        }
        /* USART Ch.2 Rx end */
        if ((1UL == bM4_USART2->SR_b.RXNE) && (0UL != (VSSEL137 & BIT_MASK_18)))
        {
            USART_2_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.2 Tx buffer empty */
    if (1UL == bM4_USART2->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART2->SR_b.TXE) && (0UL != (VSSEL137 & BIT_MASK_19)))
        {
            USART_2_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.2 Tx end */
    if (1UL == bM4_USART2->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART2->SR_b.TC) && (0UL != (VSSEL137 & BIT_MASK_20)))
        {
            USART_2_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.2 Tx timeout */
    if (1UL == bM4_USART2->CR1_b.RTOIE)
    {
        if ((1UL == bM4_USART2->SR_b.RTOF) && (0UL != (VSSEL137 & BIT_MASK_21)))
        {
            USART_2_RxTO_IrqHandler();
        }
    }
    /* SPI Ch.1 Rx end */
    if (1UL == bM4_SPI1->CR1_b.RXIE)
    {
        if ((1UL == bM4_SPI1->SR_b.RDFF) && (0UL != (VSSEL137 & BIT_MASK_22)))
        {
            SPI_1_RxEnd_IrqHandler();
        }
    }
    /* SPI Ch.1 Tx buffer empty */
    if (1UL == bM4_SPI1->CR1_b.TXIE)
    {
        if ((1UL == bM4_SPI1->SR_b.TDEF) && (0UL != (VSSEL137 & BIT_MASK_23)))
        {
            SPI_1_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.1 Bus idle */
    if (1UL == bM4_SPI1->CR1_b.IDIE)
    {
        if ((0UL == bM4_SPI1->SR_b.IDLNF) && (0UL != (VSSEL137 & BIT_MASK_24)))
        {
            SPI_1_Idle_IrqHandler();
        }
    }
    /* SPI Ch.1 parity/overflow/underflow/mode error */
    if (1UL == bM4_SPI1->CR1_b.EIE)
    {
        u32Tmp1 = M4_SPI1->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_25)))
        {
            SPI_1_Err_IrqHandler();
        }
    }
    /* SPI Ch.2 Rx end */
    if (1UL == bM4_SPI2->CR1_b.RXIE)
    {
        if ((1UL == bM4_SPI2->SR_b.RDFF) && (0UL != (VSSEL137 & BIT_MASK_27)))
        {
            SPI_2_RxEnd_IrqHandler();
        }
    }
    /* SPI Ch.2 Tx buffer empty */
    if (1UL == bM4_SPI2->CR1_b.TXIE)
    {
        if ((1UL == bM4_SPI2->SR_b.TDEF) && (0UL != (VSSEL137 & BIT_MASK_28)))
        {
            SPI_2_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.2 Bus idle */
    if (1UL == bM4_SPI2->CR1_b.IDIE)
    {
        if ((0UL == bM4_SPI2->SR_b.IDLNF) && (0UL != (VSSEL137 & BIT_MASK_29)))
        {
            SPI_2_Idle_IrqHandler();
        }
    }
    /* SPI Ch.2 parity/overflow/underflow/mode error */
    if (1UL == bM4_SPI2->CR1_b.EIE)
    {
        u32Tmp1 = M4_SPI2->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_30)))
        {
            SPI_2_Err_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.138 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ138_Handler(void)
{
    const uint32_t VSSEL138 = M4_INTC->VSSEL138;
    uint32_t u32Tmp1;
    uint8_t RTIF;
    uint8_t RTIE;
    uint8_t ERRINT;
    uint8_t TTCFG;

    /* TimerA Ch.5 overflow */
    if (1UL == bM4_TMRA_5->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_5->BCSTR_b.OVFF) && (0UL != (VSSEL138 & BIT_MASK_00)))
        {
            TMRA_5_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.5 underflow */
    if (1UL == bM4_TMRA_5->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_5->BCSTR_b.UDFF) && (0UL != (VSSEL138 & BIT_MASK_01)))
        {
            TMRA_5_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.5 compare match 1 */
    if (1UL == bM4_TMRA_5->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_5->STFLR_b.CMPF1) && (0UL != (VSSEL138 & BIT_MASK_02)))
        {
            TMRA_5_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.5 compare match 2 */
    if (1UL == bM4_TMRA_5->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_5->STFLR_b.CMPF2) && (0UL != (VSSEL138 & BIT_MASK_02)))
        {
            TMRA_5_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.5 compare match 3 */
    if (1UL == bM4_TMRA_5->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_5->STFLR_b.CMPF3) && (0UL != (VSSEL138 & BIT_MASK_02)))
        {
            TMRA_5_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.5 compare match 4 */
    if (1UL == bM4_TMRA_5->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_5->STFLR_b.CMPF4) && (0UL != (VSSEL138 & BIT_MASK_02)))
        {
            TMRA_5_Cmp4_IrqHandler();
        }
    }
    /* TimerA Ch.6 overflow */
    if (1UL == bM4_TMRA_6->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_6->BCSTR_b.OVFF) && (0UL != (VSSEL138 & BIT_MASK_03)))
        {
            TMRA_6_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.6 underflow */
    if (1UL == bM4_TMRA_6->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_6->BCSTR_b.UDFF) && (0UL != (VSSEL138 & BIT_MASK_04)))
        {
            TMRA_6_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.6 compare match 1 */
    if (1UL == bM4_TMRA_6->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_6->STFLR_b.CMPF1) && (0UL != (VSSEL138 & BIT_MASK_05)))
        {
            TMRA_6_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.6 compare match 2 */
    if (1UL == bM4_TMRA_6->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_6->STFLR_b.CMPF2) && (0UL != (VSSEL138 & BIT_MASK_05)))
        {
            TMRA_6_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.6 compare match 3 */
    if (1UL == bM4_TMRA_6->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_6->STFLR_b.CMPF3) && (0UL != (VSSEL138 & BIT_MASK_05)))
        {
            TMRA_6_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.6 compare match 4 */
    if (1UL == bM4_TMRA_6->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_6->STFLR_b.CMPF4) && (0UL != (VSSEL138 & BIT_MASK_05)))
        {
            TMRA_6_Cmp4_IrqHandler();
        }
    }
    /* TimerA Ch.7 overflow */
    if (1UL == bM4_TMRA_7->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_7->BCSTR_b.OVFF) && (0UL != (VSSEL138 & BIT_MASK_06)))
        {
            TMRA_7_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.7 underflow */
    if (1UL == bM4_TMRA_7->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_7->BCSTR_b.UDFF) && (0UL != (VSSEL138 & BIT_MASK_07)))
        {
            TMRA_7_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.7 compare match 1 */
    if (1UL == bM4_TMRA_7->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_7->STFLR_b.CMPF1) && (0UL != (VSSEL138 & BIT_MASK_08)))
        {
            TMRA_7_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.7 compare match 2 */
    if (1UL == bM4_TMRA_7->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_7->STFLR_b.CMPF2) && (0UL != (VSSEL138 & BIT_MASK_08)))
        {
            TMRA_7_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.7 compare match 3 */
    if (1UL == bM4_TMRA_7->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_7->STFLR_b.CMPF3) && (0UL != (VSSEL138 & BIT_MASK_08)))
        {
            TMRA_7_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.7 compare match 4 */
    if (1UL == bM4_TMRA_7->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_7->STFLR_b.CMPF4) && (0UL != (VSSEL138 & BIT_MASK_08)))
        {
            TMRA_7_Cmp4_IrqHandler();
        }
    }
    /* TimerA Ch.8 overflow */
    if (1UL == bM4_TMRA_8->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_8->BCSTR_b.OVFF) && (0UL != (VSSEL138 & BIT_MASK_09)))
        {
            TMRA_8_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.8 underflow */
    if (1UL == bM4_TMRA_8->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_8->BCSTR_b.UDFF) && (0UL != (VSSEL138 & BIT_MASK_10)))
        {
            TMRA_8_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.8 compare match 1 */
    if (1UL == bM4_TMRA_8->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_8->STFLR_b.CMPF1) && (0UL != (VSSEL138 & BIT_MASK_11)))
        {
            TMRA_8_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.8 compare match 2 */
    if (1UL == bM4_TMRA_8->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_8->STFLR_b.CMPF2) && (0UL != (VSSEL138 & BIT_MASK_11)))
        {
            TMRA_8_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.8 compare match 3 */
    if (1UL == bM4_TMRA_8->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_8->STFLR_b.CMPF3) && (0UL != (VSSEL138 & BIT_MASK_11)))
        {
            TMRA_8_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.8 compare match 4 */
    if (1UL == bM4_TMRA_8->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_8->STFLR_b.CMPF4) && (0UL != (VSSEL138 & BIT_MASK_11)))
        {
            TMRA_8_Cmp4_IrqHandler();
        }
    }
    if (1UL == bM4_USART3->CR1_b.RIE)
    {
        /* USART Ch.3 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART3->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL138 & BIT_MASK_12)))
        {
            USART_3_RxErr_IrqHandler();
        }
        /* USART Ch.3 Rx end */
        if ((1UL == bM4_USART3->SR_b.RXNE) && (0UL != (VSSEL138 & BIT_MASK_13)))
        {
            USART_3_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.3 Tx buffer empty */
    if (1UL == bM4_USART3->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART3->SR_b.TXE) && (0UL != (VSSEL138 & BIT_MASK_14)))
        {
            USART_3_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.3 Tx end */
    if (1UL == bM4_USART3->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART3->SR_b.TC) && (0UL != (VSSEL138 & BIT_MASK_15)))
        {
            USART_3_TxEnd_IrqHandler();
        }
    }
    if (1UL == bM4_USART4->CR1_b.RIE)
    {
        /* USART Ch.4 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART4->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL138 & BIT_MASK_16)))
        {
            USART_4_RxErr_IrqHandler();
        }
        /* USART Ch.4 Rx end */
        if ((1UL == bM4_USART4->SR_b.RXNE) && (0UL != (VSSEL138 & BIT_MASK_17)))
        {
            USART_4_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.4 Tx buffer empty */
    if (1UL == bM4_USART4->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART4->SR_b.TXE) && (0UL != (VSSEL138 & BIT_MASK_18)))
        {
            USART_4_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.4 Tx end */
    if (1UL == bM4_USART4->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART4->SR_b.TC) && (0UL != (VSSEL138 & BIT_MASK_19)))
        {
            USART_4_TxEnd_IrqHandler();
        }
    }
    /* CAN Ch.1 */
    if (0UL != (0UL != (VSSEL138 & BIT_MASK_20)))
    {
        RTIF = M4_CAN1->RTIF;
        RTIE = M4_CAN1->RTIE;
        ERRINT = M4_CAN1->ERRINT;
        TTCFG = M4_CAN1->TTCFG;
        if ((0U != (TTCFG & CAN_TTCFG_TEIF))        ||                          \
            (0U != (RTIF & CAN_RTIF_AIF))           ||                          \
            (0U != (RTIF & RTIE & 0xFEU))           ||                          \
            ((0U != (ERRINT & CAN_ERRINT_BEIE))     &&                          \
             (0U != (ERRINT & CAN_ERRINT_BEIF)))    ||                          \
            ((0U != (ERRINT & CAN_ERRINT_ALIE))     &&                          \
             (0U != (ERRINT & CAN_ERRINT_ALIF)))    ||                          \
            ((0U != (ERRINT & CAN_ERRINT_EPIE))     &&                          \
             (0U != (ERRINT & CAN_ERRINT_EPIF)))    ||                          \
            ((0U != (TTCFG & CAN_TTCFG_TTIE))       &&                          \
             (0U != (TTCFG & CAN_TTCFG_TTIF)))      ||                          \
            ((0U != (TTCFG & CAN_TTCFG_WTIE))       &&                          \
             (0U != (TTCFG & CAN_TTCFG_WTIF))))
            {
                CAN_1_IrqHandler();
            }
    }
    /* CAN Ch.2 */
    if (0UL != (0UL != (VSSEL138 & BIT_MASK_21)))
    {
        RTIF = M4_CAN2->RTIF;
        RTIE = M4_CAN2->RTIE;
        ERRINT = M4_CAN2->ERRINT;
        TTCFG = M4_CAN2->TTCFG;
        if ((0U != (TTCFG & CAN_TTCFG_TEIF))        ||                          \
            (0U != (RTIF & CAN_RTIF_AIF))           ||                          \
            (0U != (RTIF & RTIE & 0xFEU))           ||                          \
            ((0U != (ERRINT & CAN_ERRINT_BEIE))     &&                          \
             (0U != (ERRINT & CAN_ERRINT_BEIF)))    ||                          \
            ((0U != (ERRINT & CAN_ERRINT_ALIE))     &&                          \
             (0U != (ERRINT & CAN_ERRINT_ALIF)))    ||                          \
            ((0U != (ERRINT & CAN_ERRINT_EPIE))     &&                          \
             (0U != (ERRINT & CAN_ERRINT_EPIF)))    ||                          \
            ((0U != (TTCFG & CAN_TTCFG_TTIE))       &&                          \
             (0U != (TTCFG & CAN_TTCFG_TTIF)))      ||                          \
            ((0U != (TTCFG & CAN_TTCFG_WTIE))       &&                          \
             (0U != (TTCFG & CAN_TTCFG_WTIF))))
            {
                CAN_2_IrqHandler();
            }
    }
    /* SPI Ch.3 Rx end */
    if (1UL == bM4_SPI3->CR1_b.RXIE)
    {
        if ((1UL == bM4_SPI3->SR_b.RDFF) && (0UL != (VSSEL138 & BIT_MASK_22)))
        {
            SPI_3_RxEnd_IrqHandler();
        }
    }
    /* SPI Ch.3 Tx buffer empty */
    if (1UL == bM4_SPI3->CR1_b.TXIE)
    {
        if ((1UL == bM4_SPI3->SR_b.TDEF) && (0UL != (VSSEL138 & BIT_MASK_23)))
        {
            SPI_3_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.3 Bus idle */
    if (1UL == bM4_SPI3->CR1_b.IDIE)
    {
        if ((0UL == bM4_SPI3->SR_b.IDLNF) && (0UL != (VSSEL138 & BIT_MASK_24)))
        {
            SPI_3_Idle_IrqHandler();
        }
    }
    /* SPI Ch.3 parity/overflow/underflow/mode error */
    if (1UL == bM4_SPI3->CR1_b.EIE)
    {
        u32Tmp1 = M4_SPI3->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL138 & BIT_MASK_25)))
        {
            SPI_3_Err_IrqHandler();
        }
    }
    /* SPI Ch.4 Rx end */
    if (1UL == bM4_SPI4->CR1_b.RXIE)
    {
        if ((1UL == bM4_SPI4->SR_b.RDFF) && (0UL != (VSSEL138 & BIT_MASK_27)))
        {
            SPI_4_RxEnd_IrqHandler();
        }
    }
    /* SPI Ch.4 Tx buffer empty */
    if (1UL == bM4_SPI4->CR1_b.TXIE)
    {
        if ((1UL == bM4_SPI4->SR_b.TDEF) && (0UL != (VSSEL138 & BIT_MASK_28)))
        {
            SPI_4_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.4 Bus idle */
    if (1UL == bM4_SPI4->CR1_b.IDIE)
    {
        if ((0UL == bM4_SPI4->SR_b.IDLNF) && (0UL != (VSSEL138 & BIT_MASK_29)))
        {
            SPI_4_Idle_IrqHandler();
        }
    }
    /* SPI Ch.4 parity/overflow/underflow/mode error */
    if (1UL == bM4_SPI4->CR1_b.EIE)
    {
        u32Tmp1 = M4_SPI4->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL138 & BIT_MASK_30)))
        {
            SPI_4_Err_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.139 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ139_Handler(void)
{
    const uint32_t VSSEL139 = M4_INTC->VSSEL139;
    uint32_t u32Tmp1;

