RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
    /* TimerA Ch.9 overflow */
    if (1UL == bM4_TMRA_9->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_9->BCSTR_b.OVFF) && (0UL != (VSSEL139 & BIT_MASK_00)))
        {
            TMRA_9_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.9 underflow */
    if (1UL == bM4_TMRA_9->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_9->BCSTR_b.UDFF) && (0UL != (VSSEL139 & BIT_MASK_01)))
        {
            TMRA_9_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.9 compare match 1 */
    if (1UL == bM4_TMRA_9->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_9->STFLR_b.CMPF1) && (0UL != (VSSEL139 & BIT_MASK_02)))
        {
            TMRA_9_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.9 compare match 2 */
    if (1UL == bM4_TMRA_9->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_9->STFLR_b.CMPF2) && (0UL != (VSSEL139 & BIT_MASK_02)))
        {
            TMRA_9_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.9 compare match 3 */
    if (1UL == bM4_TMRA_9->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_9->STFLR_b.CMPF3) && (0UL != (VSSEL139 & BIT_MASK_02)))
        {
            TMRA_9_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.9 compare match 4 */
    if (1UL == bM4_TMRA_9->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_9->STFLR_b.CMPF4) && (0UL != (VSSEL139 & BIT_MASK_02)))
        {
            TMRA_9_Cmp4_IrqHandler();
        }
    }
    /* TimerA Ch.10 overflow */
    if (1UL == bM4_TMRA_10->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_10->BCSTR_b.OVFF) && (0UL != (VSSEL139 & BIT_MASK_03)))
        {
            TMRA_10_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.10 underflow */
    if (1UL == bM4_TMRA_10->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_10->BCSTR_b.UDFF) && (0UL != (VSSEL139 & BIT_MASK_04)))
        {
            TMRA_10_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.10 compare match 1 */
    if (1UL == bM4_TMRA_10->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_10->STFLR_b.CMPF1) && (0UL != (VSSEL139 & BIT_MASK_05)))
        {
            TMRA_10_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.10 compare match 2 */
    if (1UL == bM4_TMRA_10->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_10->STFLR_b.CMPF2) && (0UL != (VSSEL139 & BIT_MASK_05)))
        {
            TMRA_10_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.10 compare match 3 */
    if (1UL == bM4_TMRA_10->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_10->STFLR_b.CMPF3) && (0UL != (VSSEL139 & BIT_MASK_05)))
        {
            TMRA_10_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.10 compare match 4 */
    if (1UL == bM4_TMRA_10->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_10->STFLR_b.CMPF4) && (0UL != (VSSEL139 & BIT_MASK_05)))
        {
            TMRA_10_Cmp4_IrqHandler();
        }
    }
    /* TimerA Ch.11 overflow */
    if (1UL == bM4_TMRA_11->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_11->BCSTR_b.OVFF) && (0UL != (VSSEL139 & BIT_MASK_06)))
        {
            TMRA_11_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.11 underflow */
    if (1UL == bM4_TMRA_11->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_11->BCSTR_b.UDFF) && (0UL != (VSSEL139 & BIT_MASK_07)))
        {
            TMRA_11_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.11 compare match 1 */
    if (1UL == bM4_TMRA_11->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_11->STFLR_b.CMPF1) && (0UL != (VSSEL139 & BIT_MASK_08)))
        {
            TMRA_11_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.11 compare match 2 */
    if (1UL == bM4_TMRA_11->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_11->STFLR_b.CMPF2) && (0UL != (VSSEL139 & BIT_MASK_08)))
        {
            TMRA_11_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.11 compare match 3 */
    if (1UL == bM4_TMRA_11->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_11->STFLR_b.CMPF3) && (0UL != (VSSEL139 & BIT_MASK_08)))
        {
            TMRA_11_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.11 compare match 4 */
    if (1UL == bM4_TMRA_11->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_11->STFLR_b.CMPF4) && (0UL != (VSSEL139 & BIT_MASK_08)))
        {
            TMRA_11_Cmp4_IrqHandler();
        }
    }
    /* TimerA Ch.12 overflow */
    if (1UL == bM4_TMRA_12->BCSTR_b.ITENOVF)
    {
        if ((1UL == bM4_TMRA_12->BCSTR_b.OVFF) && (0UL != (VSSEL139 & BIT_MASK_09)))
        {
            TMRA_12_Ovf_IrqHandler();
        }
    }
    /* TimerA Ch.12 underflow */
    if (1UL == bM4_TMRA_12->BCSTR_b.ITENUDF)
    {
        if ((1UL == bM4_TMRA_12->BCSTR_b.UDFF) && (0UL != (VSSEL139 & BIT_MASK_10)))
        {
            TMRA_12_Udf_IrqHandler();
        }
    }
    /* TimerA Ch.12 compare match 1 */
    if (1UL == bM4_TMRA_12->ICONR_b.ITEN1)
    {
        if ((1UL == bM4_TMRA_12->STFLR_b.CMPF1) && (0UL != (VSSEL139 & BIT_MASK_11)))
        {
            TMRA_12_Cmp1_IrqHandler();
        }
    }
    /* TimerA Ch.12 compare match 2 */
    if (1UL == bM4_TMRA_12->ICONR_b.ITEN2)
    {
        if ((1UL == bM4_TMRA_12->STFLR_b.CMPF2) && (0UL != (VSSEL139 & BIT_MASK_11)))
        {
            TMRA_12_Cmp2_IrqHandler();
        }
    }
    /* TimerA Ch.12 compare match 3 */
    if (1UL == bM4_TMRA_12->ICONR_b.ITEN3)
    {
        if ((1UL == bM4_TMRA_12->STFLR_b.CMPF3) && (0UL != (VSSEL139 & BIT_MASK_11)))
        {
            TMRA_12_Cmp3_IrqHandler();
        }
    }
    /* TimerA Ch.12 compare match 4 */
    if (1UL == bM4_TMRA_12->ICONR_b.ITEN4)
    {
        if ((1UL == bM4_TMRA_12->STFLR_b.CMPF4) && (0UL != (VSSEL139 & BIT_MASK_11)))
        {
            TMRA_12_Cmp4_IrqHandler();
        }
    }
    /* USART Ch.5 LIN bus break */
    if (1UL == bM4_USART5->CR2_b.LBDIE)
    {
        if ((1UL == bM4_USART5->SR_b.LBD) && (0UL != (VSSEL139 & BIT_MASK_12)))
        {
            USART_5_LinBreakField_IrqHandler();
        }
    }
    /* USART Ch.5 LIN bus wakeup */
    if (1UL == bM4_USART5->CR2_b.WKUPE)
    {
        if ((1UL == bM4_USART5->SR_b.WKUP) && (0UL != (VSSEL139 & BIT_MASK_12)))
        {
            USART_5_LinWakeup_IrqHandler();
        }
    }
    if (1UL == bM4_USART5->CR1_b.RIE)
    {
        /* USART Ch.5 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART5->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL139 & BIT_MASK_13)))
        {
            USART_5_RxErr_IrqHandler();
        }
        /* USART Ch.5 Rx end */
        if ((1UL == bM4_USART5->SR_b.RXNE) && (0UL != (VSSEL139 & BIT_MASK_14)))
        {
            USART_5_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.5 Tx buffer empty */
    if (1UL == bM4_USART5->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART5->SR_b.TXE) && (0UL != (VSSEL139 & BIT_MASK_15)))
        {
            USART_5_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.5 Tx end */
    if (1UL == bM4_USART5->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART5->SR_b.TC) && (0UL != (VSSEL139 & BIT_MASK_16)))
        {
            USART_5_TxEnd_IrqHandler();
        }
    }
    if (1UL == bM4_USART6->CR1_b.RIE)
    {
        /* USART Ch.6 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART6->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL139 & BIT_MASK_17)))
        {
            USART_6_RxErr_IrqHandler();
        }
        /* USART Ch.6 Rx end */
        if ((1UL == bM4_USART6->SR_b.RXNE) && (0UL != (VSSEL139 & BIT_MASK_18)))
        {
            USART_6_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.6 Tx buffer empty */
    if (1UL == bM4_USART6->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART6->SR_b.TXE) && (0UL != (VSSEL139 & BIT_MASK_19)))
        {
            USART_6_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.6 Tx end */
    if (1UL == bM4_USART6->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART6->SR_b.TC) && (0UL != (VSSEL139 & BIT_MASK_20)))
        {
            USART_6_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.6 Tx timeout */
    if (1UL == bM4_USART6->CR1_b.RTOIE)
    {
        if ((1UL == bM4_USART6->SR_b.RTOF) && (0UL != (VSSEL139 & BIT_MASK_21)))
        {
            USART_6_RxTO_IrqHandler();
        }
    }
    /* SPI Ch.5 Rx end */
    if (1UL == bM4_SPI5->CR1_b.RXIE)
    {
        if ((1UL == bM4_SPI5->SR_b.RDFF) && (0UL != (VSSEL139 & BIT_MASK_22)))
        {
            SPI_5_RxEnd_IrqHandler();
        }
    }
    /* SPI Ch.5 Tx buffer empty */
    if (1UL == bM4_SPI5->CR1_b.TXIE)
    {
        if ((1UL == bM4_SPI5->SR_b.TDEF) && (0UL != (VSSEL139 & BIT_MASK_23)))
        {
            SPI_5_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.5 Bus idle */
    if (1UL == bM4_SPI5->CR1_b.IDIE)
    {
        if ((0UL == bM4_SPI5->SR_b.IDLNF) && (0UL != (VSSEL139 & BIT_MASK_24)))
        {
            SPI_5_Idle_IrqHandler();
        }
    }
    /* SPI Ch.5 parity/overflow/underflow/mode error */
    if (1UL == bM4_SPI5->CR1_b.EIE)
    {
        u32Tmp1 = M4_SPI5->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL139 & BIT_MASK_25)))
        {
            SPI_5_Err_IrqHandler();
        }
    }
    /* SPI Ch.6 Rx end */
    if (1UL == bM4_SPI6->CR1_b.RXIE)
    {
        if ((1UL == bM4_SPI6->SR_b.RDFF) && (0UL != (VSSEL139 & BIT_MASK_27)))
        {
            SPI_6_RxEnd_IrqHandler();
        }
    }
    /* SPI Ch.6 Tx buffer empty */
    if (1UL == bM4_SPI6->CR1_b.TXIE)
    {
        if ((1UL == bM4_SPI6->SR_b.TDEF) && (0UL != (VSSEL139 & BIT_MASK_28)))
        {
            SPI_6_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.6 Bus idle */
    if (1UL == bM4_SPI6->CR1_b.IDIE)
    {
        if ((0UL == bM4_SPI6->SR_b.IDLNF) && (0UL != (VSSEL139 & BIT_MASK_29)))
        {
            SPI_6_Idle_IrqHandler();
        }
    }
    /* SPI Ch.6 parity/overflow/underflow/mode error */
    if (1UL == bM4_SPI6->CR1_b.EIE)
    {
        u32Tmp1 = M4_SPI6->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL139 & BIT_MASK_30)))
        {
            SPI_6_Err_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.140 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ140_Handler(void)
{
    const uint32_t VSSEL140 = M4_INTC->VSSEL140;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    uint16_t NORINTST;
    uint16_t NORINTSGEN;
    uint16_t ERRINTSGEN;
    uint32_t MMC_REVSTSR;
    uint32_t MMC_TRSSTSR;
    uint32_t MMC_RITCTLR;
    uint32_t MMC_TITCTLR;
    uint32_t DMA_DMASTSR;
    uint32_t DMA_INTENAR;
    uint32_t PTP_INTE;
    uint32_t PMT_INTMASK;
    uint32_t PMT_INTSTSR;
    uint32_t PTP_INTMASK;
    uint32_t PTP_INTSTSR;

    /* I2S Ch.1 Tx */
    if (1UL == bM4_I2S1->CTRL_b.TXIE)
    {
        if ((1UL == bM4_I2S1->SR_b.TXBA) && (0UL != (VSSEL140 & BIT_MASK_00)))
        {
            I2S_1_Tx_IrqHandler();
        }
    }
    /* I2S Ch.1 Rx */
    if (1UL == bM4_I2S1->CTRL_b.RXIE)
    {
        if ((1UL == bM4_I2S1->SR_b.RXBA) && (0UL != (VSSEL140 & BIT_MASK_01)))
        {
            I2S_1_Rx_IrqHandler();
        }
    }
    /* I2S Ch.1 Error */
    if (1UL == bM4_I2S1->CTRL_b.EIE)
    {
        u32Tmp1 = M4_I2S1->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_02)))
        {
            I2S_1_Err_IrqHandler();
        }
    }
    /* I2S Ch.2 Tx */
    if (1UL == bM4_I2S2->CTRL_b.TXIE)
    {
        if ((1UL == bM4_I2S2->SR_b.TXBA) && (0UL != (VSSEL140 & BIT_MASK_03)))
        {
            I2S_2_Tx_IrqHandler();
        }
    }
    /* I2S Ch.2 Rx */
    if (1UL == bM4_I2S2->CTRL_b.RXIE)
    {
        if ((1UL == bM4_I2S2->SR_b.RXBA) && (0UL != (VSSEL140 & BIT_MASK_04)))
        {
            I2S_2_Rx_IrqHandler();
        }
    }
    /* I2S Ch.2 Error */
    if (1UL == bM4_I2S2->CTRL_b.EIE)
    {
        u32Tmp1 = M4_I2S2->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_05)))
        {
            I2S_2_Err_IrqHandler();
        }
    }
    if (1UL == bM4_USART7->CR1_b.RIE)
    {
        /* USART Ch.7 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART7->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_06)))
        {
            USART_7_RxErr_IrqHandler();
        }
        /* USART Ch.7 Rx end */
        if ((1UL == bM4_USART7->SR_b.RXNE) && (0UL != (VSSEL140 & BIT_MASK_07)))
        {
            USART_7_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.7 Tx buffer empty */
    if (1UL == bM4_USART7->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART7->SR_b.TXE) && (0UL != (VSSEL140 & BIT_MASK_08)))
        {
            USART_7_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.7 Tx end */
    if (1UL == bM4_USART7->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART7->SR_b.TC) && (0UL != (VSSEL140 & BIT_MASK_09)))
        {
            USART_7_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.7 Tx timeout */
    if (1UL == bM4_USART7->CR1_b.RTOIE)
    {
        if ((1UL == bM4_USART7->SR_b.RTOF) && (0UL != (VSSEL140 & BIT_MASK_10)))
        {
            USART_7_RxTO_IrqHandler();
        }
    }
    if (1UL == bM4_USART8->CR1_b.RIE)
    {
        /* USART Ch.8 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART8->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_11)))
        {
            USART_8_RxErr_IrqHandler();
        }
        /* USART Ch.8 Rx end */
        if ((1UL == bM4_USART8->SR_b.RXNE) && (0UL != (VSSEL140 & BIT_MASK_12)))
        {
            USART_8_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.8 Tx buffer empty */
    if (1UL == bM4_USART8->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART8->SR_b.TXE) && (0UL != (VSSEL140 & BIT_MASK_13)))
        {
            USART_8_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.8 Tx end */
    if (1UL == bM4_USART8->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART8->SR_b.TC) && (0UL != (VSSEL140 & BIT_MASK_14)))
        {
            USART_8_TxEnd_IrqHandler();
        }
    }
    /* USB FS global interrupt */
    if (1UL == bM4_USBFS->GAHBCFG_b.GLBLINTRMSK)
    {
        u32Tmp1 = M4_USBFS->GINTMSK & 0xF77CFCFBUL;
        u32Tmp2 = M4_USBFS->GINTSTS & 0xF77CFCFBUL;
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL140 & BIT_MASK_15)))
        {
            USBFS_Global_IrqHandler();
        }
    }
    /* SDIO unit 1 */
    if (0UL != (VSSEL140 & BIT_MASK_20))
    {
        NORINTST = M4_SDIOC1->NORINTST & (SDIOC_NORINTST_CINT | SDIOC_NORINTST_CRM | SDIOC_NORINTST_CIST |  \
                                          SDIOC_NORINTST_BRR  | SDIOC_NORINTST_BWR | SDIOC_NORINTST_BGE  |  \
                                          SDIOC_NORINTST_TC   | SDIOC_NORINTST_CC);
        NORINTSGEN = M4_SDIOC1->NORINTSGEN & (SDIOC_NORINTSTEN_CINTEN | SDIOC_NORINTSTEN_CRMEN |    \
                                              SDIOC_NORINTSTEN_CISTEN | SDIOC_NORINTSTEN_BRREN |    \
                                              SDIOC_NORINTSTEN_BWREN  | SDIOC_NORINTSTEN_BGEEN |    \
                                              SDIOC_NORINTSTEN_TCEN   | SDIOC_NORINTSTEN_CCEN);
        ERRINTSGEN = M4_SDIOC1->ERRINTSGEN & (SDIOC_ERRINTSTEN_ACEEN | SDIOC_ERRINTSTEN_DEBEEN |    \
                                              SDIOC_ERRINTSTEN_DCEEN | SDIOC_ERRINTSTEN_DTOEEN |    \
                                              SDIOC_ERRINTSTEN_CIEEN | SDIOC_ERRINTSTEN_CEBEEN |    \
                                              SDIOC_ERRINTSTEN_CCEEN | SDIOC_ERRINTSTEN_CTOEEN);
        if (0U != (NORINTST & NORINTSGEN))
        {
            SDIOC_1_Normal_IrqHandler();
        }
        if ((1UL == bM4_SDIOC1->NORINTST_b.EI) && (0U != ERRINTSGEN))
        {
            SDIOC_1_Error_IrqHandler();
        }
    }
    /* SDIO unit 2 */
    if (0UL != (VSSEL140 & BIT_MASK_23))
    {
        NORINTST = M4_SDIOC2->NORINTST & (SDIOC_NORINTST_CINT | SDIOC_NORINTST_CRM | SDIOC_NORINTST_CIST |  \
                                          SDIOC_NORINTST_BRR  | SDIOC_NORINTST_BWR | SDIOC_NORINTST_BGE  |  \
                                          SDIOC_NORINTST_TC   | SDIOC_NORINTST_CC);
        NORINTSGEN = M4_SDIOC2->NORINTSGEN & (SDIOC_NORINTSTEN_CINTEN | SDIOC_NORINTSTEN_CRMEN |    \
                                              SDIOC_NORINTSTEN_CISTEN | SDIOC_NORINTSTEN_BRREN |    \
                                              SDIOC_NORINTSTEN_BWREN  | SDIOC_NORINTSTEN_BGEEN |    \
                                              SDIOC_NORINTSTEN_TCEN   | SDIOC_NORINTSTEN_CCEN);
        ERRINTSGEN = M4_SDIOC2->ERRINTSGEN & (SDIOC_ERRINTSTEN_ACEEN | SDIOC_ERRINTSTEN_DEBEEN |    \
                                              SDIOC_ERRINTSTEN_DCEEN | SDIOC_ERRINTSTEN_DTOEEN |    \
                                              SDIOC_ERRINTSTEN_CIEEN | SDIOC_ERRINTSTEN_CEBEEN |    \
                                              SDIOC_ERRINTSTEN_CCEEN | SDIOC_ERRINTSTEN_CTOEEN);
        if (0U != (NORINTST & NORINTSGEN))
        {
            SDIOC_2_Normal_IrqHandler();
        }
        if ((1UL == bM4_SDIOC2->NORINTST_b.EI) && (0U != ERRINTSGEN))
        {
            SDIOC_2_Error_IrqHandler();
        }
    }
    /* Ethernat global */
    MMC_REVSTSR = M4_ETH->MMC_REVSTSR & (ETH_MMC_REVSTSR_RXOEIS | ETH_MMC_REVSTSR_RXLEIS |  \
                                         ETH_MMC_REVSTSR_RXUGIS | ETH_MMC_REVSTSR_RXREIS |  \
                                         ETH_MMC_REVSTSR_RXAEIS | ETH_MMC_REVSTSR_RXCEIS |  \
                                         ETH_MMC_REVSTSR_RXMGIS | ETH_MMC_REVSTSR_RXBGIS);
    MMC_TRSSTSR = M4_ETH->MMC_TRSSTSR & (ETH_MMC_TRSSTSR_TXEDEIS| ETH_MMC_TRSSTSR_TXUGIS |  \
                                         ETH_MMC_TRSSTSR_TXCAEIS| ETH_MMC_TRSSTSR_TXECEIS|  \
                                         ETH_MMC_TRSSTSR_TXLCEIS| ETH_MMC_TRSSTSR_TXDEEIS|  \
                                         ETH_MMC_TRSSTSR_TXMGIS | ETH_MMC_TRSSTSR_TXBGIS);
    MMC_RITCTLR = M4_ETH->MMC_RITCTLR & (ETH_MMC_RITCTLR_RXBGIM | ETH_MMC_RITCTLR_RXMGIM |  \
                                         ETH_MMC_RITCTLR_RXCEIM | ETH_MMC_RITCTLR_RXAEIM |  \
                                         ETH_MMC_RITCTLR_RXREIM | ETH_MMC_RITCTLR_RXUGIM |  \
                                         ETH_MMC_RITCTLR_RXLEIM | ETH_MMC_RITCTLR_RXOEIM);
    MMC_TITCTLR = M4_ETH->MMC_TITCTLR & (ETH_MMC_TITCTLR_TXBGIM | ETH_MMC_TITCTLR_TXMGIM |  \
                                         ETH_MMC_TITCTLR_TXDEEIM| ETH_MMC_TITCTLR_TXLCEIM|  \
                                         ETH_MMC_TITCTLR_TXECEIM| ETH_MMC_TITCTLR_TXCAEIM|  \
                                         ETH_MMC_TITCTLR_TXUGIM | ETH_MMC_TITCTLR_TXEDEIM);
    PMT_INTMASK = bM4_ETH->MAC_INTMSKR_b.PMTIM;
    PMT_INTSTSR  = bM4_ETH->MAC_INTSTSR_b.PMTIS;
    PTP_INTMASK = bM4_ETH->MAC_INTMSKR_b.TSPIM;
    PTP_INTSTSR  = bM4_ETH->MAC_INTSTSR_b.TSPIS;
    PTP_INTE    = bM4_ETH->PTP_TSPCTLR_b.TSPINT;

