RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_interrupts.c
    DMA_DMASTSR = M4_ETH->DMA_DMASTSR & (ETH_DMA_DMASTSR_AIS | ETH_DMA_DMASTSR_NIS);
    DMA_INTENAR = M4_ETH->DMA_INTENAR & (ETH_DMA_INTENAR_AIE | ETH_DMA_INTENAR_NIE);
    if (0UL != (VSSEL140 & BIT_MASK_28))
    {
        if ((0UL != (MMC_REVSTSR & (~MMC_RITCTLR))) ||                          \
            (0UL != (MMC_TRSSTSR & (~MMC_TITCTLR))) ||                          \
            (0UL != (PMT_INTSTSR & (~PMT_INTMASK))) ||                          \
            (0UL != (PTP_INTSTSR & (~PTP_INTMASK) & PTP_INTE)) ||               \
            (0UL != (DMA_DMASTSR & DMA_INTENAR)))
        {
            ETH_Global_IrqHandler();
        }
    }

    /* Ethernat wakeup */
    if (0UL == bM4_ETH->MAC_INTMSKR_b.PMTIM)
    {
        if ((1UL == bM4_ETH->MAC_INTSTSR_b.PMTIS) && (0UL != (VSSEL140 & BIT_MASK_29)))
        {
            ETH_Wakeup_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.141 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ141_Handler(void)
{
    const uint32_t VSSEL141 = M4_INTC->VSSEL141;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

    /* I2S Ch.3 Tx */
    if (1UL == bM4_I2S3->CTRL_b.TXIE)
    {
        if ((1UL == bM4_I2S3->SR_b.TXBA) && (0UL != (VSSEL141 & BIT_MASK_00)))
        {
            I2S_3_Tx_IrqHandler();
        }
    }
    /* I2S Ch.3 Rx */
    if (1UL == bM4_I2S3->CTRL_b.RXIE)
    {
        if ((1UL == bM4_I2S3->SR_b.RXBA) && (0UL != (VSSEL141 & BIT_MASK_01)))
        {
            I2S_3_Rx_IrqHandler();
        }
    }
    /* I2S Ch.3 Error */
    if (1UL == bM4_I2S3->CTRL_b.EIE)
    {
        u32Tmp1 = M4_I2S3->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL141 & BIT_MASK_02)))
        {
            I2S_3_Err_IrqHandler();
        }
    }
    /* I2S Ch.4 Tx */
    if (1UL == bM4_I2S4->CTRL_b.TXIE)
    {
        if ((1UL == bM4_I2S4->SR_b.TXBA) && (0UL != (VSSEL141 & BIT_MASK_03)))
        {
            I2S_4_Tx_IrqHandler();
        }
    }
    /* I2S Ch.4 Rx */
    if (1UL == bM4_I2S4->CTRL_b.RXIE)
    {
        if ((1UL == bM4_I2S4->SR_b.RXBA) && (0UL != (VSSEL141 & BIT_MASK_04)))
        {
            I2S_4_Rx_IrqHandler();
        }
    }
    /* I2S Ch.4 Error */
    if (1UL == bM4_I2S4->CTRL_b.EIE)
    {
        u32Tmp1 = M4_I2S4->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL141 & BIT_MASK_05)))
        {
            I2S_4_Err_IrqHandler();
        }
    }
    if (1UL == bM4_USART9->CR1_b.RIE)
    {
        /* USART Ch.9 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART9->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL141 & BIT_MASK_06)))
        {
            USART_9_RxErr_IrqHandler();
        }
        /* USART Ch.9 Rx end */
        if ((1UL == bM4_USART9->SR_b.RXNE) && (0UL != (VSSEL141 & BIT_MASK_07)))
        {
            USART_9_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.9 Tx buffer empty */
    if (1UL == bM4_USART9->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART9->SR_b.TXE) && (0UL != (VSSEL141 & BIT_MASK_08)))
        {
            USART_9_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.9 Tx end */
    if (1UL == bM4_USART9->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART9->SR_b.TC) && (0UL != (VSSEL141 & BIT_MASK_09)))
        {
            USART_9_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.10 LIN bus break */
    if (1UL == bM4_USART10->CR2_b.LBDIE)
    {
        if ((1UL == bM4_USART10->SR_b.LBD) && (0UL != (VSSEL141 & BIT_MASK_10)))
        {
            USART_10_LinBreakField_IrqHandler();
        }
    }
    /* USART Ch.10 LIN bus wakeup */
    if (1UL == bM4_USART10->CR2_b.WKUPE)
    {
        if ((1UL == bM4_USART10->SR_b.WKUP) && (0UL != (VSSEL141 & BIT_MASK_10)))
        {
            USART_10_LinWakeup_IrqHandler();
        }
    }
    if (1UL == bM4_USART10->CR1_b.RIE)
    {
        /* USART Ch.10 Rx ORE/FE/PE error */
        u32Tmp1 = M4_USART10->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL141 & BIT_MASK_11)))
        {
            USART_10_RxErr_IrqHandler();
        }
        /* USART Ch.10 Rx end */
        if ((1UL == bM4_USART10->SR_b.RXNE) && (0UL != (VSSEL141 & BIT_MASK_12)))
        {
            USART_10_RxEnd_IrqHandler();
        }
    }
    /* USART Ch.10 Tx buffer empty */
    if (1UL == bM4_USART10->CR1_b.TXEIE)
    {
        if ((1UL == bM4_USART10->SR_b.TXE) && (0UL != (VSSEL141 & BIT_MASK_13)))
        {
            USART_10_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.10 Tx end */
    if (1UL == bM4_USART10->CR1_b.TCIE)
    {
        if ((1UL == bM4_USART10->SR_b.TC) && (0UL != (VSSEL141 & BIT_MASK_14)))
        {
            USART_10_TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.1 Rx end */
    if (1UL == bM4_I2C1->CR2_b.RFULLIE)
    {
        if ((1UL == bM4_I2C1->SR_b.RFULLF) && (0UL != (VSSEL141 & BIT_MASK_16)))
        {
            I2C_1_RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.1 Tx buffer empty */
    if (1UL == bM4_I2C1->CR2_b.TEMPTYIE)
    {
        if ((1UL == bM4_I2C1->SR_b.TEMPTYF) && (0UL != (VSSEL141 & BIT_MASK_17)))
        {
            I2C_1_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.1 Tx end */
    if (1UL == bM4_I2C1->CR2_b.TENDIE)
    {
        if ((1UL == bM4_I2C1->SR_b.TENDF) && (0UL != (VSSEL141 & BIT_MASK_18)))
        {
            I2C_1_TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.1 Error */
    u32Tmp1 = M4_I2C1->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = M4_I2C1->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL141 & BIT_MASK_19)))
    {
        I2C_1_Err_IrqHandler();
    }
    /* I2C Ch.2 Rx end */
    if (1UL == bM4_I2C2->CR2_b.RFULLIE)
    {
        if ((1UL == bM4_I2C2->SR_b.RFULLF) && (0UL != (VSSEL141 & BIT_MASK_20)))
        {
            I2C_2_RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.2 Tx buffer empty */
    if (1UL == bM4_I2C2->CR2_b.TEMPTYIE)
    {
        if ((1UL == bM4_I2C2->SR_b.TEMPTYF) && (0UL != (VSSEL141 & BIT_MASK_21)))
        {
            I2C_2_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.2 Tx end */
    if (1UL == bM4_I2C2->CR2_b.TENDIE)
    {
        if ((1UL == bM4_I2C2->SR_b.TENDF) && (0UL != (VSSEL141 & BIT_MASK_22)))
        {
            I2C_2_TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.2 Error */
    u32Tmp1 = M4_I2C2->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = M4_I2C2->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL141 & BIT_MASK_23)))
    {
        I2C_2_Err_IrqHandler();
    }
    /* I2C Ch.3 Rx end */
    if (1UL == bM4_I2C3->CR2_b.RFULLIE)
    {
        if ((1UL == bM4_I2C3->SR_b.RFULLF) && (0UL != (VSSEL141 & BIT_MASK_24)))
        {
            I2C_3_RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.3 Tx buffer empty */
    if (1UL == bM4_I2C3->CR2_b.TEMPTYIE)
    {
        if ((1UL == bM4_I2C3->SR_b.TEMPTYF) && (0UL != (VSSEL141 & BIT_MASK_25)))
        {
            I2C_3_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.3 Tx end */
    if (1UL == bM4_I2C3->CR2_b.TENDIE)
    {
        if ((1UL == bM4_I2C3->SR_b.TENDF) && (0UL != (VSSEL141 & BIT_MASK_26)))
        {
            I2C_3_TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.3 Error */
    u32Tmp1 = M4_I2C3->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = M4_I2C3->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL141 & BIT_MASK_27)))
    {
        I2C_3_Err_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.142 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ142_Handler(void)
{
    const uint32_t VSSEL142 = M4_INTC->VSSEL142;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

    /* I2C Ch.4 Rx end */
    if (1UL == bM4_I2C4->CR2_b.RFULLIE)
    {
        if ((1UL == bM4_I2C4->SR_b.RFULLF) && (0UL != (VSSEL142 & BIT_MASK_00)))
        {
            I2C_4_RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.4 Tx buffer empty */
    if (1UL == bM4_I2C4->CR2_b.TEMPTYIE)
    {
        if ((1UL == bM4_I2C4->SR_b.TEMPTYF) && (0UL != (VSSEL142 & BIT_MASK_01)))
        {
            I2C_4_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.4 Tx end */
    if (1UL == bM4_I2C4->CR2_b.TENDIE)
    {
        if ((1UL == bM4_I2C4->SR_b.TENDF) && (0UL != (VSSEL142 & BIT_MASK_02)))
        {
            I2C_4_TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.4 Error */
    u32Tmp1 = M4_I2C4->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = M4_I2C4->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL142 & BIT_MASK_03)))
    {
        I2C_4_Err_IrqHandler();
    }
    /* I2C Ch.5 Rx end */
    if (1UL == bM4_I2C5->CR2_b.RFULLIE)
    {
        if ((1UL == bM4_I2C5->SR_b.RFULLF) && (0UL != (VSSEL142 & BIT_MASK_04)))
        {
            I2C_5_RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.5 Tx buffer empty */
    if (1UL == bM4_I2C5->CR2_b.TEMPTYIE)
    {
        if ((1UL == bM4_I2C5->SR_b.TEMPTYF) && (0UL != (VSSEL142 & BIT_MASK_05)))
        {
            I2C_5_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.5 Tx end */
    if (1UL == bM4_I2C5->CR2_b.TENDIE)
    {
        if ((1UL == bM4_I2C5->SR_b.TENDF) && (0UL != (VSSEL142 & BIT_MASK_06)))
        {
            I2C_5_TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.5 Error */
    u32Tmp1 = M4_I2C5->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = M4_I2C5->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL142 & BIT_MASK_07)))
    {
        I2C_5_Err_IrqHandler();
    }
    /* I2C Ch.6 Rx end */
    if (1UL == bM4_I2C6->CR2_b.RFULLIE)
    {
        if ((1UL == bM4_I2C6->SR_b.RFULLF) && (0UL != (VSSEL142 & BIT_MASK_08)))
        {
            I2C_6_RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.6 Tx buffer empty */
    if (1UL == bM4_I2C6->CR2_b.TEMPTYIE)
    {
        if ((1UL == bM4_I2C6->SR_b.TEMPTYF) && (0UL != (VSSEL142 & BIT_MASK_09)))
        {
            I2C_6_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.6 Tx end */
    if (1UL == bM4_I2C6->CR2_b.TENDIE)
    {
        if ((1UL == bM4_I2C6->SR_b.TENDF) && (0UL != (VSSEL142 & BIT_MASK_10)))
        {
            I2C_6_TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.6 Error */
    u32Tmp1 = M4_I2C6->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = M4_I2C6->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL142 & BIT_MASK_11)))
    {
        I2C_6_Err_IrqHandler();
    }
    /* PVD Ch.1 */
    if (1UL == bM4_PWC->PVDCR1_b.PVD1IRE)
    {
        if ((1UL ==bM4_PWC->PVDDSR_b.PVD1DETFLG) && (0UL != (VSSEL142 & BIT_MASK_13)))
        {
            PWC_Pvd1_IrqHandler();
        }
    }
    /* PVD Ch.2 */
    if (1UL == bM4_PWC->PVDCR1_b.PVD2IRE)
    {
        if ((1UL ==bM4_PWC->PVDDSR_b.PVD2DETFLG) && (0UL != (VSSEL142 & BIT_MASK_14)))
        {
            PWC_Pvd2_IrqHandler();
        }
    }
    /* FCM error */
    if (1UL == bM4_FCM->RIER_b.ERRIE)
    {
        if ((1UL == bM4_FCM->SR_b.ERRF) && (0UL != (VSSEL142 & BIT_MASK_16)))
        {
            FCM_Err_IrqHandler();
        }
    }
    /* FCM end */
    if (1UL == bM4_FCM->RIER_b.MENDIE)
    {
        if ((1UL == bM4_FCM->SR_b.MENDF) && (0UL != (VSSEL142 & BIT_MASK_17)))
        {
            FCM_End_IrqHandler();
        }
    }
    /* FCM overflow */
    if (1UL == bM4_FCM->RIER_b.OVFIE)
    {
        if ((1UL == bM4_FCM->SR_b.OVF) && (0UL != (VSSEL142 & BIT_MASK_18)))
        {
            FCM_Ovf_IrqHandler();
        }
    }
    /* WDT underflow or refresh error */
    u32Tmp1 = M4_WDT->SR & (WDT_SR_UDF | WDT_SR_REF);
    if ((0UL != u32Tmp1) && (0UL != (VSSEL142 & BIT_MASK_19)))
    {
        WDT_IrqHandler();
    }
    /* CTC overflow or underflow error */
    if (1UL == bM4_CTC->CR1_b.ERRIE)
    {
        /* underflow */
        if ((1UL == bM4_CTC->STR_b.TRMUDF) && (0UL != (VSSEL142 & BIT_MASK_20)))
        {
            CTC_Udf_IrqHandler();
        }
        /* overflow */
        if ((1UL == bM4_CTC->STR_b.TRMOVF) && (0UL != (VSSEL142 & BIT_MASK_20)))
        {
            CTC_Ovf_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.143 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ143_Handler(void)
{
    const uint32_t VSSEL143 = M4_INTC->VSSEL143;
    uint32_t u32Tmp1;

    /* ADC unit1 sequence A */
    if (1UL == bM4_ADC1->ICR_b.EOCAIEN)
    {
        if ((1UL == bM4_ADC1->ISR_b.EOCAF) && (0UL != (VSSEL143 & BIT_MASK_00)))
        {
            ADC_1_SeqA_IrqHandler();
        }
    }
    /* ADC unit1 sequence B */
    if (1UL == bM4_ADC1->ICR_b.EOCBIEN)
    {
        if ((1UL == bM4_ADC1->ISR_b.EOCBF) && (0UL != (VSSEL143 & BIT_MASK_01)))
        {
            ADC_1_SeqB_IrqHandler();
        }
    }
    /* ADC unit1 window 0 compare */
    if (1UL == bM4_ADC1->AWDCR_b.AWD0IEN)
    {
        if ((1UL == bM4_ADC1->AWDSR_b.AWD0F) && (0UL != (VSSEL143 & BIT_MASK_02)))
        {
            ADC_1_Cmp0_IrqHandler();
        }
    }
    /* ADC unit1 window 1 compare */
    if (1UL == bM4_ADC1->AWDCR_b.AWD1IEN)
    {
        /* independence use */
        u32Tmp1 = (uint16_t)(M4_ADC1->AWDCR & ADC_AWDCR_AWDCM);
        if ((1UL == bM4_ADC1->AWDSR_b.AWD1F) && (0UL == u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_03)))
        {
            ADC_1_Cmp1Ind_IrqHandler();
        }
        /* combination use */
        if ((1UL == bM4_ADC1->AWDSR_b.AWDCMF) && (0UL != u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_03)))
        {
            ADC_1_Cmp1Comb_IrqHandler();
        }
    }
    /* ADC unit2 sequence A */
    if (1UL == bM4_ADC2->ICR_b.EOCAIEN)
    {
        if ((1UL == bM4_ADC2->ISR_b.EOCAF) && (0UL != (VSSEL143 & BIT_MASK_04)))
        {
            ADC_2_SeqA_IrqHandler();
        }
    }
    /* ADC unit2 sequence B */
    if (1UL == bM4_ADC2->ICR_b.EOCBIEN)
    {
        if ((1UL == bM4_ADC2->ISR_b.EOCBF) && (0UL != (VSSEL143 & BIT_MASK_05)))
        {
            ADC_2_SeqB_IrqHandler();
        }
    }
    /* ADC unit2 window 0 compare */
    if (1UL == bM4_ADC2->AWDCR_b.AWD0IEN)
    {
        if ((1UL == bM4_ADC2->AWDSR_b.AWD0F) && (0UL != (VSSEL143 & BIT_MASK_06)))
        {
            ADC_2_Cmp0_IrqHandler();
        }
    }
    /* ADC unit2 window 1 compare */
    if (1UL == bM4_ADC2->AWDCR_b.AWD1IEN)
    {
        /* independence use */
        u32Tmp1 = ((uint16_t)(M4_ADC2->AWDCR & ADC_AWDCR_AWDCM));
        if ((1UL == bM4_ADC2->AWDSR_b.AWD1F) && (0UL == u32Tmp1) && (0UL != (0UL != (VSSEL143 & BIT_MASK_07))))
        {
            ADC_2_Cmp1Ind_IrqHandler();
        }
        /* combination use */
        if ((1UL == bM4_ADC2->AWDSR_b.AWDCMF) && (0UL != u32Tmp1) && (0UL != (0UL != (VSSEL143 & BIT_MASK_07))))
        {
            ADC_2_Cmp1Comb_IrqHandler();
        }
    }
    /* ADC unit3 sequence A */
    if (1UL == bM4_ADC3->ICR_b.EOCAIEN)
    {
        if ((1UL == bM4_ADC3->ISR_b.EOCAF) && (0UL != (VSSEL143 & BIT_MASK_04)))
        {
            ADC_3_SeqA_IrqHandler();
        }
    }
    /* ADC unit3 sequence B */
    if (1UL == bM4_ADC3->ICR_b.EOCBIEN)
    {
        if ((1UL == bM4_ADC3->ISR_b.EOCBF) && (0UL != (VSSEL143 & BIT_MASK_08)))
        {
            ADC_3_SeqB_IrqHandler();
        }
    }
    /* ADC unit3 window 0 compare */
    if (1UL == bM4_ADC3->AWDCR_b.AWD0IEN)
    {
        if ((1UL == bM4_ADC3->AWDSR_b.AWD0F) && (0UL != (VSSEL143 & BIT_MASK_09)))
        {
            ADC_3_Cmp0_IrqHandler();
        }
    }
    /* ADC unit3 window 1 compare */
    if (1UL == bM4_ADC3->AWDCR_b.AWD1IEN)
    {
        /* independence use */
        u32Tmp1 = (uint16_t)(M4_ADC3->AWDCR & ADC_AWDCR_AWDCM);
        if ((1UL == bM4_ADC3->AWDSR_b.AWD1F) && (0UL == u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_10)))
        {
            ADC_3_Cmp1Ind_IrqHandler();
        }
        /* combination use */
        if ((1UL == bM4_ADC3->AWDSR_b.AWDCMF) && (0UL != u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_10)))
        {
            ADC_3_Cmp1Comb_IrqHandler();
        }
    }
    if (0UL != (VSSEL143 & BIT_MASK_16))
    {
        if (0UL != (M4_NFC->IRSR & (NFC_IRSR_RBRS | NFC_IRSR_ECCERS |           \
                    NFC_IRSR_ECCCRS | NFC_IRSR_ECCECRS | NFC_IRSR_ECCEURS)))
        {
            NFC_IrqHandler();
        }
    }
}
/**
 * @}
 */

